[
{
  "name": "д-р Вангел Ајановски",
  "description": "Роден е 1975 година во Скопје. Основно и средно насочено училиште завршил во Скопје со звање информатички техничар. Добитник е на неколку награди на државните натпревари за средношколци по информатика, математика и физика. Во 1993 година се запишал на студии по информатика на Природно-математичкиот факултет во Скопје, кои ги завршил во 1999 година како најдобар дипломиран студент на ИИ и се стекнал со звањето дипломиран инженер по информатика. По повод 50-годишниот јубилеј на Универзитетот, во 2000 година, е добитник на награда за трудот „Систем на пријавување испити преку Интернет“, како најдобар проект од областа на информатиката. Истата година бил избран за стручен соработник, во 2002 за помлад асистент, во 2007 за асистент на која позиција премина на ФИНКИ во 2011 година. Во 2013 година е избран за доцент на ФИНКИ. Во 2006 година ги завршил последипломските студии со одбраната на магистеркиот труд под наслов \"Јавни информациски системи и информациски портали\". Во 2013 година ја одбранил докторската дисертација под наслов “Адаптивни и социјални само-структурирачки системи за навигација низ јавни информациски системи“. Во рамките на наставниот процес на ИИ учествува како соработник во изведувањето на наставата по следниве предмети: бази на податоци, бази на податоци 2, информациски системи, анализа и логички дизајн на ИС, физички дизајн и имплементација на ИС, компјутерска графика, тимска работа, мултимедија, операциони истражувања, системски софтвер, проектирање компјутерски мрежи, програмски системи, математичка логика и алгебра, вовед во информатиката за физичари, вовед во информатиката за хемичари и вовед во информатиката на Факултетот за замјоделски науки и храна. Во 2003 година учествувал во формирањето на регионалната CISCO-академија во која е регионален инструктор за CCNA курсеви. Како соработник на ИИ учествувал во реализацијата на 30-тина меѓународни и домашни проекти, од кои од особено значење се проектите за унапредување на мрежата на МАРНет и УКИМ и мрежните сервиси (SINSEE, NATO, UNESCO-HP, SEEGRID, SEEREN, GEANT) во моментот е водач на македонскиот дел од тимот во рамките на активноста Network Factory во рамките на GEANT3 проектот. Учествувал во формирањето на информацискиот систем на ИИ, како и на ПМФ уште од 1996 година, учествувал во повеќе TEMPUS и DAAD проекти за реконструкции на наставните планови на студиите по информатика и на ИИ, но и на универзитети од соседните држави. Учествувал во формирањето лаборатории за видеоконференции, компјутерска графика, оперативни системи, бази на податоци, мултимедија и далечинско образование. Од 2005-2009 година бил раководител на Компјутерскиот центар при ИИ. Архитект и главен изведувач или соизведувач бил на поголемиот дел од мрежната инфраструктура и компјутерски сервиси на ИИ. Објавил 16 научни трудови во списанија и во зборници од конференции и одржал 25 презентации. Учествувал во имплементација на голем број јавни веб страници за неколку организации, системи за знаење и географско мапирање. Член е на ACM на ниво докторанд (во групите SIGMIS и SIGCHI), а во минатото бил и член на IEEE и AACE.. Во рамките на интересите ги има воопшто софверските решенија и компјутерските системи и е автор на првата книга за користење на оперативниот систем Windows во Македонија - „Основи на Windows 3.1“ во 1994 година, во кој период бил уредник и автор на повеќе од сто написи во дневни и месечни списанија. Се занимава и со дигитален звук и обработка, композиција и аранжман и автор е на поголем број композиции објавени на Интернет и дел од првата македонска компилација на електронска музика „Macidonia: Class of 999” во издание на PMG Recordings.\n.",
  "consultative_terms": "Редовни консултацииДен: среда12:00 - 14:00Училница: M3Ден: понеделник12:00 - 14:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Миле Јованов",
  "description": "е роден 1980 година во Кавадарци, каде завршил основно и средно образование како најдобар ученик во генерацијата. Дипломирал на Институтот за информатика при Природно-математичкиот факултет (ПМФ) во Скопје во 2002 година, како најдобар студент на факултетот. Магистрира на ПМФ во 2009, а докторира на ФИНКИ во 2013. По дипломирањето бил назначен за демонстратор на Институтот. Од 2005 година е вработен како помлад асистент/асистент на ПМФ, при формирањето се префрла на ФИНКИ, каде е избран во звањето доцент во 2014, вонреден професор во 2018 година и редовен професор во 2023. На ФИНКИ бил Раководител на Институтот за Интелигентни системи. Изведувал настава на дваесетина предмети на додипломските, магистерските и докторските студии. Ментор е на два докторанти и на повеќе дипломски работи, а автор е на петнаесетина учебници/прирачници.\nБил организатор и/или претседавач на дваесетина конференции, семинари и работилници од меѓународен карактер, а автор е на повеќе од 70 научни публикации од областа на информатичка едукација, натпреварувачко програмирање, семантички веб и интелигентни системи, објавени во меѓународни списанија/конференции. Тој е едитор на интернационално списание и член на програмски одбор во неколку реномирани меѓународни конференции. Учествувал/ко-раководел со повеќе меѓународни проекти.\nОд 2003 е во комисиите за натпревари по информатика, од 2008 година е  организатор на натпреварите, а од 2009 е и Претседател на Здружението на информатичарите на Македонија. Водел македонски тимови ученици на повеќе од 30 изданија од врвните меѓународни натпревари по информатика (Интернационална олимпијада (ИОИ), Балканска олимпијада (БОИ), Европска и Балканска јуниорска олимпијада) со освоени повеќе од 80 медали. Од 2014 година е Претседател на БОИ, а од 2015 е избран член на интернационалниот комитет на ИОИ. Претседавал/организирал десетина изданија на балканските олимпијади. Учествувал во изработката на десетина наставни програми по информатичките предмети во основното и средното државно образование, и во повеќе владини комисии за стратегии и иновации во образованието, а е еден од иницијаторите на новата Математичко-информатичка гимназија за талентирани ученици во Скопје.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток15:45 - 17:15Училница: Online (Courses - Консултации), OnlineДен: среда13:30 - 15:30Училница: ТМФ 320"
},
{
  "name": "д-р Билјана Стојкоска",
  "description": "Родена во 1982 година во Охрид. Дипломирала и магистрирала на Факултетот за електротехника и информациски технологии во Скопје во 2006 и 2008 година, соодветно. Во моментов работи на докторската теза. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнала да работи од 2005 год. како демонстратор. Во 2009 година е избрана за помлад асистент. Одговорна е за изведување вежби по предмети од областа на алгоритми и структури на податоци, дистрибуирани компјутерски системи, експертни системи, мобилни информациони системи, проектирање на вградливи компјутерски компоненти и информациони системи. Во рамките на досегашната научно-истражувачка работа објавила повеќе трудови во зборници од конференции и во меѓународни научни списанија.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток12:00 - 14:00Училница: Online (Courses - Консултации), OnlineДен: петок11:30 - 13:30Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Весна Димитриевска Ристовска",
  "description": "д-р Весна Димитриевска Ристовска е родена 1968 год. во Скопје. Основно и средно образование завршила во Скопје, со континуиран одличен успех.\nДипломирала на Природно-математичкиот Факултет во Скопје на студиите по информатика со просечна оценка на студиите 9.43, со одбрана на дипломска работа со наслов “Паралелизација на секвенцијална програма“. Во јануари 2007 година го одбранила магистерскиот труд под наслов “Квантитативни мерки за рамномерна распределба на низи“, со што се здобила со звањето магистер по информатички науки. Во 2013 година на ФИНКИ ја одбранила докторската дисертација на тема ,,Квази Монте карло интегрирање во тежински Хилбертови простори и врска со дијафонијата – математички модели и софтверска реализација”.\nВо рамките на наставно-образовната дејност на УКИМ, Факултет за информатички науки и компјутерско инженерство,  д-р Весна Димитриевска Ристовска изведувала или изведува настава по предметите: Калкулус 1, Калкулус 2, Калкулус 3, Математика 1, Математика 2 и Дискретна математика 1 на прв циклус студии, на предметите: Оптимизација и Калкулус 3 на втор циклус студии.\nКако асистент на ИИ, при ПМФ изведувала аудиториумски и лабораториски вежби по предметите: калкулус 1, калкулус 2, калкулус 3, основи на програмирање, бази податоци, основи на оперативни системи, аналитичка геометрија, нумеричко сметање, вектори и матрици, нумерички методи, диференцијално сметање, вовед во информатиката 1, функции од повеќе променливи, информатика, математичка анализа, теорија на информации, програмирање и програмирање на сметачки машини.\nВо последните 5 години д-р Весна Димитриевска Ристовска има објавено неколку научни трудови од областите математика, информатика и компјутерска техника и информатика.\n.",
  "consultative_terms": ""
},
{
  "name": "д-р Смилка Јанеска-Саркањац",
  "description": "Родена е 1968 година во Прилеп. Во 1992 год. завршила Електро-технички факултет на Универзитетот “Св. Кирил и Методиј” во Скопје, насока Компјутерска техника и автоматика. Во 2005 година се запишува на последипломски студии на Економскиот факултет на Универзитетот “Св. Кирил и Методиј” во Скопје, на насоката МБА менаџмент, и магистрира во 2009 година со темата „Информационата технологија во стратегијата на претпријатието“. Во јуни 2011 година на Економскиот факултет на Универзитетот “Св. Кирил и Методиј” во Скопје ја одбранила докторската дисертација под наслов „Стратегиски модели на е-Управување“. Во 2009 година е избрана за асистент на Универзитетот Американ колеџ во Скопје, на Факултетот за деловна економија и организациони науки, а во 2011 година е избрана за асистент на Факултетот за информатички науки и компјутерско инженерство на Универзитетот “Св. Кирил и Методиј” во Скопје. Има долгодишно искуство во ИКТ секторот во Македонија. Работела во ИКТ одделите на повеќе претпријатија од приватниот сектор, на различни позиции, како програмер, бизнис аналитичар, ИТ администратор, водач на  тим за развој на апликативен софтвер, и како Директор на сектор за информатика во осигурителна компанија. Била ангажирана како сениор ИТ експерт од страна на Европската агенција за реконструкција.Посетувала бројни обуки главно од областа на менаџмент и информациски технологии. Има напишано неколку стручни и научни трудови. Нејзино поле на интерес се информациски системи од аспект на нивната примена, менаџмент и стратегии на информациските системи во компаниите од приватниот сектор и во јавниот сектор, како и примена на информациски и комуникациски технологии за развој.\n.",
  "consultative_terms": "Редовни консултацииДен: среда12:00 - 14:00Училница: ТМФ 36Ден: среда17:00 - 19:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Ѓорѓи Маџаров",
  "description": "Роден е 1984 година во Велес. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2007 година, на насоката компјутерска техника, информатика и автоматика со просек 10.00, како најдобар во својата генерација. Добитник е на наградата „Златник“ од Универзитетот „Свети Кирил и Методиј“ и „Златен прстен“ од организацијата на инженерите на Македонија. Во 2009-та година ја одбранил магистерската тема и се стекнал со научното звање магистер на електротехнички науки област компјутерска техника и информатика. Докторската дисертација ја одбранил во 2012-та година под менторство на проф. Дејан Ѓорѓевиќ и коменторство на проф. Сашо Џероски на Факултетот за информатички науки и компјутерско инженерство. Своето прво работно искуство го стекнал во Друштвото за компјутерски услуги „Netcetera“ - Скопје, во одделот за софтвер и веб развој. Во рамките на досегашната научно-истражувачка работа, учествувал во изработката на повеќе научни и стручни трудови објавени на домашни и меѓународни конференции и списанија. Полињата на неговиот научно-истражувачки интерес вклучуваат: препознавање на облици, машинско учење и софтверско инженерство.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник10:00 - 12:00Училница: Ф10Ден: четврток07:00 - 09:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Игор Мишковски",
  "description": "Роден е 1981 година во Скопје. Дипломирал на Електротехничкиот факултет во Скопје во 2005 година. Магистрирал на Факултетот за електротехника и информациски технологии во 2008 година. Во моментов работи на докторската теза од областа на ранливост на комплексни мрежи. Веднаш по дипломирањето започнал со работа на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје како демонстратор. Од крајот на 2007 година работи како помлад асистент по предметите од областа компјутерска техника и информатика. Во текот на неговиот работен ангажман дава значаен придонес во осмислувањето, креирањето и организацијата на аудиториски и лабораториски вежби. Активно учествувал во истражувања од областа на комплексните и компјутерските мрежи и има објавено 10 научни трудови на меѓународни и домашни конференции и списанија. Учествувал во изработката на 4 книги, како и во поголем број на научно истражувачки и апликативни проекти. Области на негов научно-истражувачки интерес се комплексни мрежи, компјутерски мрежи, безжични мобилни ад хок мрежи, апликативен софтвер и веб технологии, дизајнирање на системи на чип.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник14:00 - 16:00Училница: M10Ден: понеделник14:00 - 16:00Училница: M10"
},
{
  "name": "д-р Соња Гиевска",
  "description": "Родена е 1963 година во Скопје. Дипломирала на Електротехничкиот факултет во Скопје (1986), магистрирала на Електротехничкиот факултет во Загреб (1993) и докторирала на универзитетот „Џорџ Вашингтон“, САД (2004). Во 1990 година е вработена на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје како помлад асистент. Звањата асистент и доцент ги стекнала во 1993 и 2005 година, соодветно. За време на докторските студии во САД (1997-2003) и во периодот од 2006 до денес, предавала и учествувала во истражувачката дејност на универзитетот „Џорџ Вашингтон“, САД. Нејзината научно-истражувачката работа е од областа на кориснички интерфејси со посебен интерес за интелигентни интерфејси базирани на агенти, репрезентација на контекст во интелигентни системи и мултимедиски системи. Автор/коавтор е на околу четириесетина научни трудови публикувани во зборници од меѓународни конференции, едитирани книги и меѓу народни научни списанија. Учествувала во десетина научно-истражувачки проекти во Македонија и САД. Нејзините актуелни истражувања се фокусирани на интелигентни системи за поддршка на интеракцијата човек-компјутер, посебно наменети за системи во кои сигурноста и безбедноста на корисниците и опремата се од критична важност.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник10:00 - 12:00Училница: АНЕКС ФЕИТДен: среда09:00 - 11:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Ивица Димитровски",
  "description": "Роден е 1981 година во Кратово. Дипломирал на Електротехничкиот факултет во Скопје во 2005 година. Магистрирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнал да работи од 2005 година прво како демонстратор, во 2007 година e избран во звањето помлад асистент, a во 2009 во асистент. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на структурирано програмирање, објектно ориентирано програмирање, интернет програмирање, кориснички интерфејси, визуелизација и виртуелна реалност. Во рамките на досегашната научно-истражувачка работа учествувал во изработката на повеќе публикувани научно-истражувачки трудови и три поглавја во книги. Полињата на научно-истражувачки интерес вклучуваат обработка на слики и видео, извлекување на визуелни карактеристики за сликите, содржинско базирано пребарување на мултимедијални податоци, машинско учење.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник09:00 - 11:00Училница: Online (Courses - Консултации), OnlineДен: вторник09:45 - 11:45Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Дејан Спасов",
  "description": "Роден е 1976 година во Скопје. Во 2003-та година дипломира на Електротехничкиот факултет во Скопје. Магистерските студии ги продолжува на Бостон Универзитетот во Бостон, Масачусетс. Магистерската работа „Имплементирање на Лексикографската конструкција“ ја одбранил во 2006-та година. Во 2008-ма година е вработен како помлад асистент на Институтот за Информатика при Природно-математичкиот факултет. Во 2010 ја одбранил докторската дисертација „Прилог кон некои особини на добрите кодови“ на Природно-математичкиот факултет во Скопје. Има остварено два студиски престои: во 2001-ва година на Институтот за Нелинеарни науки, при Универзитетот во Калифоринја во Сан Диего и во 2010 година во Опатија, Р. Хрватска на NATO институтот за напредни студии. Научен интерес на д-р Дејан Спасов се теорија за кодирање и компјутерски мрежи. Во досегашната научно-истражувачка работа има учествувано на 6 конференции во земјата и странство, при што има објавено 8 научни труда и една статија во меѓународно научно списание. Има учествувано на три меѓународни проекти.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток09:00 - 10:00Училница: M4Ден: вторник12:00 - 13:00Училница: M4"
},
{
  "name": "д-р Гоце Арменски",
  "description": "Роден е 1976 година во Скопје. Основно и средно образование оформил во Скопје и бил добитник на повеќе награди и признанија на републички и на сојузни натпревари по математика и физика. Во 1995 година се запишал на Електротехничкиот факултет во Скопје, отсек компјутерска техника, информатика и автоматика. Во текот на студиите 5 пати бил наградуван за одличен успех во студирањето. Дипломирал во 2000 година,со одбрана на дипломската работа под наслов “Публикување преку WEB“ со среден успех 9,36. Постдипломски студии по информатика запишал на ПМФ во Скопје. Магистерскиот труд со наслов “Електронско тестирање”, изработен под менторство на проф. д-р Марјан Гушев, го одбранил во 2003 година По дипломирањето бил избран за помлад асистент на ИИ, а по магистрирањето, во 2004 година, за асистент. Докторира во 2010 година со докторската дисертација со наслов „Сервис-ориентирана архитектура во е-тестирање“ и во истата година е избран за доцент. Изведувал/изведува вежби по предметите: вовед во информатиката I и II, интернет, интернет-технологии, архитектура на компјутерите, компјутерски мрежи, проектирање на компјутерски мрежи, мултимедија, компјутерски апликации, дизајнирање на образовен софтвер, компјутерски системи во наставата - за студентите по информатика и вовед во информатиката - за студентите по географија и математика-физика. Главно подрачје на научен интерес му се електтронската проверка на знаењето, електронското учење, веб-апликациите, сервис-ориентираната архитектура. Објавил 2 научни трудa во меѓународни списаниja од областа на електронското учење и електронска влада и 22 научни труда во зборници од домашни и од меѓународни конференции. Учесник и раковдител е на неколку проекти од областа на електронскиот бизнис и електронското образование. Во 2003 година добил меѓународна стипендија од Светската организација на научници со седиште во Швајцарија за реализација на проектот “Компјутерски помогнато учење, модели, концепти и апликации за далечинско учење”. Во 2005 година бил член на работната група за изработка на Националната стратегија и акциониот план за развој на информатичко општество. Членува во IEEE, Светската федерација на научници и во ETAI (Друштво за електроника, телекомуникации, автоматика и информатика на Македонија).\n.",
  "consultative_terms": "Редовни консултацииДен: петок08:00 - 10:00Училница: Online (Courses - Консултации), OnlineДен: среда12:00 - 14:00Училница: M5"
},
{
  "name": "д-р Весна Димитрова",
  "description": "Роденa е 1974 година во Скопје. Основното и средното образование го завршила во Скопје, со континуиран одличен успех. На студиите по информатика на Институтот за Информатика при ПМФ, применета насока дипломирала во јуни 1997 со дипломска работа од областа криптографијата под наслов “Софтверска реализација на безбедна комуникација со C модули под UNIX” под менторство на проф. д-р Смиле Марковски, редовен професор на ПМФ. Во текот на школувањето примала стипендија за талентирани ученици и студенти. Во мај 2005 година јавно го одбранила нејзиниот магистерски труд под наслов „Квазигрупни трансформации и нивни примени“ под менторство на проф. д-р Смиле Марковски, а во ноември 2010 јавно ја одбранила и нејзината докторска теза под наслов “Квазигрупно процесирани низи, нивна Булова презентација и примена во криптогафијата и теоријата на кодирање” исто така под менторство на проф. д-р Смиле Марковски и се здобила со звањето доктор на информатички науки. Од април 2000 година е вработена како стручен соработник на Институтот за информатика при ПМФ. Во февруари 2011 година е избрана за доцент на Институтот за Информатика. Во текот на својот ангажман на Институтот за информатика, држела вежби по 14 предмети. Има подготвено електронски учебни материјали за повеќе предмети. Од странските јазици зборува и пишува англиски јазик, разбира германски и руски јазик. Научното поле на интерес е криптографијата, посебно квазигрупните трансформации и нивната примена во криптографијата. До сега има објавено 19 научни труда и има учествувано со свои излагања на преку 30 конференции, симпозиуми, конгреси, семинари, школи и работилници. Била еден од предавачите на школата “Algebraic Structures and their Applications in Codding theory and Cryptography” во Охрид, 2009 во рамки на DAAD проект. Има неколку академски престои: во Johannes Kepler University, во Линц, Австрија, во Бугарската Академија на науките, во Софија, Бугарија, во South Bank University во Лондон, Велика Британија и др. Била член во 8 домашни и меѓународни проекти. Покрај активната дејност во наставната и научно-истражувачката работа, има и голема стручно-професионална дејност. Има објавено 9 стручни труда, два технички извештаи и два постера за конференции. Ја има преведено и рецензирано книгата од областа на криптографијата “Практична криптографија”. Член е на Здружението ICT-ACT, на Здружението на Информатичарите на Македонија и на центарот за Дигитизација на Националното Наследство на Македонија на Институтот за информатика при ПМФ. Била член во организација на три меѓународни конференции и е уредник на проширената книга апстракти на една меѓународна конференција.\n.",
  "consultative_terms": "Редовни консултацииДен: среда10:00 - 12:00Училница: ТМФ 209Ден: понеделник12:00 - 14:00Училница: ТМФ 209"
},
{
  "name": "д-р Боро Јакимовски",
  "description": "Роден на 1 март 1978 година во Скопје, каде што ги завршил основното и средното образование со одличен успех. Во текот на школувањето учествувал и освојувал награди на повеќе натпревари, меѓу кои на Државниот натпревар по информатика за средношколци во 1996 година освоил I награда, а учествувал на 8. Интернационална олимпијада по информатика и на 4. Балканска олимпијада по информатика, како претставник од Р. Македонија. При завршувањето на средното училиште бил прогласен за првенец на генерацијата. Истовремено, со успех ги завршил курсевите по англиски јазик во Центарот за странски јазици во Скопје и се стекнал со диплома од Универзитетот во Кембриџ за положен прв сертификат по англиски јазик. На студиите по информатика на ПМФ се запишал во академската 1996/97 година Дипломирал во 2000 година како најдобар студент на Факултетот и на Универзитетот, со среден успех 9.91. Во текот на студиите добил многубројни признанија за учество на меѓународни студентски натпревари за програмирање, организирани од здружението ACM, на кои во 1999 година го освоил второто место, како член на тимот на студенти по информатика при ИИ, и се пласирал за 24. ACM интернационално студентско светско финале, кое се одржа во 2000 година во Орландо, САД. По третата година на студииите, престојувал во лабораториите на компанијата Филипс во Ајндховен, Холандија, каде што работел на проучување на техниките за кодирање кај мултикаст-протоколите. Од октомври 2000 до март 2001 година работел како демонстратор на ИИ при ПМФ, а потоа бил избран за помлад асистент. Во 2001 година запишал постдипломски студии по информатика при ПМФ, кои ги завршил во 2004 година, со одбрана на магистерскиот труд под наслов “Комуникации кај грид-технологијата”, под менторство на проф. д-р Марјан Гушев. Во 2010 година со одбрана на докторската дисертација под наслов \"Моделирање и верификација на грид процесни текови\" се здобил со звањето доктор по информатички науки, по што во 2011 е избран за доцент. Изведува настава по предметите: мрежни и дистрибуирани оперативни системи, системски софтвер, вовед во ИТ. За студентите на ИИ изведувал вежби по предметите: вовед во информатиката 1, вовед во информатиката 2, конечна математика, нумеричко сметање со програмирање, програмски јазици, архитектура на компјутерските системи, алгоритми и автомати, структури на податоци, формални јазици и автомати, оперативни системи, паралелно и дистрибуирано процесирање, мрежни оперативни системи, теорија на програмирањето и системски софтвер. Раководител е на меѓународниот проект од FP7 програмата за Европската грид иницијатива. Бил соработник во 15 меѓународни проекти од областа на информатиката и унапредувањето на наставата по информатика. Значителен удел има во проектите SEE-GRID, SEE-GRID-2, SEE-GRID-SCI, како главно лице за техничките активности во имплементацијата на грид-технологијата во Република Македонија. Учествувал во преку 20 работилници како предавач и има остварено 10 кратки посети на универзитети и летни школи. Научниот интерес му претставуаат областите: грид пресметување, пресметување со високи перформанси, паралелно и дистрибуирано процесирање, генетски алгоритми, од кои има објавено 18 научни трудови на меѓународни конференции и 1 научен труд во меѓународно списание.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник08:10 - 10:00Училница: ДеканатДен: среда08:00 - 10:00Училница: Деканат"
},
{
  "name": "д-р Ласко Баснарков",
  "description": "Ласко Баснарков е роден во Кавадарци, во 1977 година. Димпломира на Електротехничкиот факултет во Скопје во 2000 година, на насоката електроника и телекомуникации. Магистрира во 2005, а докторира во 2009 година на Природно-математичкиот факултет во Скопје, во областа теориска физика. Работи како асистент по физика на Електротехничкиот факултет (подоцна Факултет за електротехника и информациски технологии) од 2002 година. Од септември 2011 година е вработен на Факултетот за информатички науки и компјутерско инженерство, како доцент по физика.\nЦентрално место во научниот интерес на Ласко Баснарков завземаат нелинеарната динамика и статистичката физика. Подетално се занимавал со проучување на детерминистичка и стохастичка дифузија и синхронизација на фазни осцилатори. Денес неговите истражувања се насочени кон употребата на синхронизацијата за моделирање на климата и моделирање на финансиски временски серии. Главни алатки кои ги користи во своите истражувања се математичка анализа и компјутерски симулации.\n.",
  "consultative_terms": "Редовни консултацииДен: среда10:00 - 12:00Училница: M11Ден: понеделник12:00 - 14:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Соња Филипоска",
  "description": "Родена е 1980 година во Скопје. Дипломирала на Електротехничкиот факултет во Скопје во 2003 година. Магистрирала и докторирала на Факултетот за електротехника и информациски технологии во Скопје во 2007 и 2009 година, соодветно. Со работа на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнала веднаш по дипломирањето во 2003 година со звање како помлад асистент. Во 2007 година е избрана во звањето асистент, а во 2009 за доцент. Има објавено над триесетина научни трудови. Автор е и на повеќе книги наменети за едукација во полето на користење апликативни програми. Има учествувано во повеќе домашни и меѓународни научни и апликативни проекти. Области на нејзин научно-истражувачки интерес се безжични мобилни ад хок мрежи, комплексни мрежи, компјутерски мрежи, апликативен софтвер, електромагнетна компатибилност.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник10:00 - 12:00Училница: ТМФ 10Ден: среда12:00 - 14:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Иван Чорбев",
  "description": "Роден е 1980 година во Охрид. Дипломирал и магистрирал на Електротехничкиот факултет во Скопје во 2004 и 2006 година, соодветно. Докторирал на Факултетот за електротехника и информациски технологии во Скопје во 2009 година. Во текот на факултетското образование бил континуирано наградуван за успешните студии. Како најдобар студент во генерацијата е наградуван од Факултетот, универзитетот “Св. Кирил и Методиј” и други организации и фондации, меѓу кои Организацијата на инженерите на Македонија, од која ја добил наградата златен прстен. Своето прво работно искуство го стекнал во АД “Македонски телекомуникации” - МТнет, во одделот за софтвер и веб развој, во периодот 2003-2005 година. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнал да работи од 2005 година, прво како демонстратор и потоа од 2006 година и како помлад асистент. Звањето асистент го добил во 2008 година, а во 2009 година е избран за доцент. Неговите наставни обврски опфаќале настава по предмети од областа на структурирано програмирање, објектно-ориентирано програмирање, програмски методологии, веб дизајн, компјутерска графика, компјутерска анимација, итн.\nВо рамките на досегашната научно-истражувачка работа до 2011 година учествувал во изработката на повеќе од 35 научно-истражувачки трудови публикувани во книги, списанија и реценирани зборници од конференции. Полињата на негов научно-истражувачки интерес вклучуваат комбинаторна оптимизација, евристички алгоритми, програмирање со ограничувања, технологии за веб програмирање, тестирање на софтвер, примена на информатиката во медицината и телемедицински системи, медицински експертски системи, екстракција на знаење, машинско учење. Автор е на еден универзитетски учебник. Рецензент е на еден универзитетски учебник.\nКако IT консултант бил ангажиран при студии и развој на повеќе апликативни решенија за Enterprise Resource Planning (ERP) системи, универзитетски информациони системи, веб системи за менаџирање со содржини (CMS), Document Management Systems - DMS, системи за онлајн плаќање, електронска евиденција на присуство, банкарски апликации, нафтена индустрија. Учествувал како IT консултант во проекти финансирани од Европската унија (FP6, FP7, TEMPUS), невладини организации (NDI).\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник16:30 - 18:15Училница: Ф14, OnlineДен: среда16:30 - 18:00Училница: Ф14, Online"
},
{
  "name": "Славе Темков",
  "description": "Славе Темков е роден на 10.01.1999 година, во Кавадарци, Република Северна Македонија. Завршува основно училиште во Кавадарци, Република Северна Македонија, а во гимназијата СОУ Гимназија „Добри Даскалов“ исто така во Кавадарци, на смер ПМА (Природно математичко подрачје - а) завршува средно образование со одличен успех. Своето образование во 2017 година го продолжува на додипломските студии на Факултетот за информатички науки и компјутерско инженерство - Скопје, на насоката Компјутерски науки и инженерство. Дипломира во мај 2022 година со просечна оценка 9.73, со дипломска на тема „Преглед на Magnolia CMS преку практична имплементација на веб сајт“, под менторство на проф. д-р. Иван Китановски.\nВо учебната година 2022/2023 се запишува на магистерски студии на ФИНКИ, насока Софтверско инженерство.\nВо октомври 2022 година е избран за демонстратор и изведува аудиториски и лабораториски вежби по предметите Алгоритми и податочни структури, Напреден веб дизајн, Програмирање на видео игри и Методологија на истражувањето во ИКТ.\nНаучните полиња од негов особен интерес се: наука за податоците, експертни системи и софтверско инженерство.",
  "consultative_terms": "Редовни консултацииДополнителни консултации Датум: 15-05-202517:00 - 18:30Училница: ТМФ 122, OnlineДен: вторник16:30 - 18:00Училница: ТМФ 122, OnlineДен: понеделник10:00 - 11:30Училница: ТМФ 122, Online"
},
{
  "name": "Милена Трајаноска",
  "description": "Милена Трајаноска е родена во Скопје 1999 година. Средно образование завршува во гимназијата „Раде Јовчевски - Корчагин“ со одличен успех како првенец на генерација.\nДипломира на Факултетот за информатички науки и компјутерско инженерство во 2022 година со дипломски труд „Предвидување на глобални конфликти меѓу држави преку мрежно моделирање на нивните интеракции“ под менторство на проф. д-р Димитар Трајанов. Добитник е на признанието „Инженерски прстен“ и наградена е од универзитетот „Св. Кирил и Методиј“ како најдобар студент на генерацијата.\nПаралелно со студиите, повеќе години работи во индустријата како инженер за машинско учење и архитект на софтверски решенија. Соработник е на неколку софтверски проекти со отворен код. Има искуство со изработување на решенија од областа на процесирање на природни јазици и компјутерска визија.\nВо учебната 2022/2023 година се запишува на магистерски студии на Факултетот за информатички науки и компјутерско инженерство на насоката Управување во информатички технологии. Во 2023 година во февруари е избрана за демонстратор на факултетот.\nПолињата на нејзин научно-истражувачки интерес вклучуваат: процесирање на природните јазици, големи јазични модели, компјутерска визија, наука за податоци, пресметување во облак, MLOps и софтверски архитектури.",
  "consultative_terms": "Редовни консултацииДен: понеделник15:00 - 16:00Училница: M8, OnlineДен: среда14:00 - 15:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Томе Ефтимов",
  "description": "",
  "consultative_terms": ""
},
{
  "name": "д-р Андреј Ристески",
  "description": "Андреј Ристески е доцент во одделот за машинско учење Bo универзитетот Carnegie Mellon. Пред позицијата Bo Carnegie Mellon, Андреј беше Norbert Wiener Fellow во одделот за применета математика во универзитетот MIT, како и во институтот за Data Science и статистика (IDSS). Андреј има докторат по компјутерски науки од универзитетот Принстон, каде исто дипломира.\nНеговата област на истражување се математичките и научни основи на машинско учење и вештачка интелегенција, со особен фокус на длабоко учење и невронски мрежи. Андреј редовно објавува во врвните конференции за машинско учење (NeurIPS, ICML, ICLR), како итеоретски компјутерски науки (STOC, COLT). Тој исто редовно служи BO организациони и рецензентски комитети за овие конференции.",
  "consultative_terms": ""
},
{
  "name": "Јана Кузманова",
  "description": ".",
  "consultative_terms": "Редовни консултацииДен: вторник10:00 - 12:00Училница: Online (Courses - Консултации), OnlineДен: четврток16:00 - 18:00Училница: ТМФ 332"
},
{
  "name": "м-р Димитар Китановски",
  "description": "Димитар Китановски е роден во 1998 година во Битола. Основно образование завршил во ОУ „Гоце Делчев“ во Ресен, додека средно образование завршил во СОТУ „Ѓорѓи Наумов“ во Битола со континуиран одличен успех. За време на школувањето, учествувал на неколку натпревари и има освоено повеќе награди и признанија. Покрај школувањето има учествувано и на неколку практични настави во ИТ компании преку кои го надградувал своето знаење.\nНа Факултетот за информатички науки и компјутерско инженерство се запишал во 2016 година. Во текот на последните две години од студиите работел како соработник на Факултетот за информатички науки и компјутерско инженерство. Дипломирал во 2020 година со дипломски труд на тема „Систем за само-евалуација наменет за високо образование“, под менторство на проф. д-р Иван Чорбев.  Магистрирал во 2022 година на ФИНКИ, на насоката Управување во информатички технологии и истата учебна година, 2022/23 се запишува на докторски студии на ФИНКИ, на насоката Компјутерски науки и инженерство.\nВо ноември 2020 година ја започнува својата академска кариера како вработен на Факултетот за информатички науки и компјутерско инженерство, избран во наставно-научно звање демонстратор, при што изведува аудиториски и лабораториски вежби. Во 2023 година е избран во наставно-научно звање асистент.\nПолиња на негов научно-истражувачи интерес се: инженерство на податоци, бази и складишта на податоци, машинско учење, вештачка интелигенција, наука базирана на податоци и софтверско инженерство.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник19:00 - 20:30Училница: Online (Courses - Консултации), OnlineДен: среда14:00 - 15:30Училница: Online (Courses - Консултации), Online"
},
{
  "name": "м-р Стефан Андонов",
  "description": "м-р Стефан Андонов е роден 1997 година во Неготино, каде што го завршува своето основно и средно образование со континуиран одличен успех.\nДодипломските студии на ФИНКИ ги завршува во 2019 со просечна оценка 9.38. Магистерските студии на смерот софтверско инженерство на ФИНКИ ги завршил во 2022 со просечна оценка 10.0 и одбрана на магистерскиот труд „Откривање на аномалии во логови со учење на репрезентација на графови“ под менторство на проф. д-р Ѓорѓи Маџаров. Во 2023 се запишал на докторски студии на ФИНКИ на насоката компјутерски науки и инженерство.\nСвоето прво работно искуство го стекнува во компанијата Elevate Global како инженер за податоци. Во март 2018 е избран за помлад демонстратор и изведувал лабораториска настава на ФИНКИ како лаборант на повеќе предмети на ФИНКИ. Во ноември 2019 година е избран во наставно звање демонстратор на ФИНКИ и изведува настава по предметите Стуктурно програмирање, Објектно-ориентирано програмирање, Напредно програмирање, Софтверско инженерство, Визуелно програмирање, Вовед во компјутерските науки, Криптографија и Рударење на масивни податоци. Во 2023 година е избран во наставно-научно звање асистент.\nПолиња од негов научен интерес се вештачка интелигенција во ИТ операции (AIOps), машинско учење на графови, анализа и предвидување на временски серии, дистрибуирано процесирање на масивни податоци, софтверско инженерство и инженерство на податоци.\n.",
  "consultative_terms": "Редовни консултацииДен: среда16:00 - 17:30Училница: Ф10, Online"
},
{
  "name": "Јована Добрева",
  "description": "Јована Добрева е родена во 1998 година во Скопје, каде завршува средно образование со одличен успех во гимназијата ,,Раде Јовчевски - Корчагин”.\nСвоето високо образование го започнува во 2016 година на Факултетот за информатички науки и компјутерско инженерство на насоката Информатика и компјутерско инженерство. Во четвртата година од студиите (2019 година) е ангажирана како лаборант на факултетот. Непосредно потоа во 2020 година дипломира со просечна оценка 9.70 со дипломскиот труд  ,,Платформа за извлекување на знаење поврзано со лекови од медицински текстови” под менторство на проф. д-р Димитар Трајанов.\nСвоето образование го продолжува во 2020 година со запишување на  постдипломски студии на насоката Управување во информатички технологии. Истата година во декември е вработена на ФИНКИ, каде одржува аудиториски и лабораториски вежби.\nПолињата на научно-истражувачки интерес и се Data Science, Machine Learning, Natural Language Processing, Big Data, Computer and Information Security.",
  "consultative_terms": "Редовни консултацииДен: вторник16:00 - 18:00Училница: M8Ден: понеделник16:00 - 18:00Училница: M8"
},
{
  "name": "Ана Тодоровска",
  "description": "Ана Тодоровска е родена во 1998 година во Битола. Основното и средното образование ги завршила во Битола со континуиран одличен успех.\nВо 2016 година се запишала на додипломски студии на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ), на насоката Компјутерски науки и инженерство - англиски јазик.\nВо текот на студиите изведувала практична работа во компаниите „Sorsix“ и „Idox Health“, а во 2019 година била ангажирана како лаборант на ФИНКИ.\nДипломирала во 2020 година со дипломскиот труд „Платформа за споделување и изнајмување на облека“, под менторство на проф. д-р Димитар Трајанов.\nВо 2022 година магистрирала со магистерска теза на тема „Моделирање на поврзаноста помеѓу дигиталните валути и класичните економски индикатори“, исто така под менторство на проф. д-р Димитар Трајанов.\nИстата година се запишала на докторски студии на ФИНКИ, на насоката Компјутерски науки и инженерство.\nОд декември 2020 година е вработена на Факултетот за информатички науки и компјутерско инженерство. Области на нејзин научно-истражувачки интерес се машинско учење, наука базирана на податоци, обработка на природни јазици и работа со големи податоци.\n.",
  "consultative_terms": ""
},
{
  "name": "Петар Секулоски",
  "description": "Петар Секулоски е роден во 1994 година во Струга. Во 2013 година се запишал на Факултетот за информатички науки и компјутерско инженерство, насока компјутерски науки и инженерство. Дипломирал во 2017 година при што се стекнал со титулата дипломиран инженер по информатички науки и компјутерско инженерство, насока компјутерски науки и инженерство. Студент е на постдипломските студии на Факултетот за информатички науки и компјутерско инженерство од 2017, на насокота Компјутерски науки. На Факултетот за информатички науки и компјутерско инженерство најпрво бил ангажиран како лаборант, а од октомври 2018 година како демонстратор. Неговиот ангажман претежно ги опфаќа математичките предмети. Одржува аудиториски вежби по Калкулус, Калкулус 1, Калкулус 2, Дискретна математика и Дискретни структури 1, како и лабораториски вежби по овие предмети. Исто така одржува/одржувал лабораториски вежби по предметите: Веројатност и статстика, Инженерска математика, Калкулус 3, Структурно програмирање, Објектно-ориентирано програмирање, Географски информациони системи и Компјутерски компоненти. Области на негов научно-инстражувачки интерес се тополошка анализа на податоци, пресметковна топологија, машинско учење како и примена на методи од алгебрска топологија во областите од компјутерски науки.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник12:00 - 14:00Училница: Online (Courses - Консултации), OnlineДен: вторник16:30 - 18:30Училница: ТМФ 321б"
},
{
  "name": "м-р Влатко Спасев",
  "description": "Влатко Спасев е роден во 1997 година во Свети Николе. Основното училиште во ООУ,,Кирил и Методиј” а средното во СОУ,,Кочо Рацин” во Свети Николе ги завршил како првенец на генерацијата. Во текот на школувањето, учествувал на повеќе регионални и државни натпревари во различни области и има освоено повеќе награди и признанија.\nНа Факултетот за Информатички Науки и Компјутерско Инженерство се запишал во 2015 година на насоката Компјутерски науки и инженерство. Во текот на студирањето има добиено признание како еден од најдобрите студенти на ФИНКИ. Дипломирал во 2019 година со просечна оценка 9,53 со дипломска тема ,,Систем за управување со камери за мониторирање на рути”. Во учебната 2019/2020 се запишува на постдипломски студии на ФИНКИ, насока Софтверско инженерство. Во март 2018 е избран за лаборант на ФИНКИ и изведувал лабораториски вежби по предметите Структурно и Објектно ориентирано програмирање, Микропроцесорски системи, Основи на веб дизајн. Во ноември 2019 година е избран за демонстратор и изведува аудиториски и лабораториски вежби по предметите Интернет програмирање, Шаблони за дизајн на кориснички интерфејси, Основи на веб дизајн, Објектно ориентирано програмирање, Вовед во когнитивни науки. Полиња на негов научно-истражувачки интерес се роботика, софтверско инженерство, управување и контрола на безпилотни летала, вградливи и сензорски системи.\n.",
  "consultative_terms": "Редовни консултацииДополнителни консултации Датум: 13-05-202511:00 - 12:00Училница: ТМФ 122Ден: понеделник19:00 - 20:00Училница: ТМФ 122"
},
{
  "name": "Мартина Тошевска",
  "description": "Мартина Тошевска е родена во Скопје. Основно и средно образование завршила во Скопје со континуиран одличен успех. Во 2014 год. се запишала на Факултетот за информатички науки и компјутерско инженерство во Скопје, на студиската програма Компјутерски науки и инженерство. Во текот на студирањето е наградувана како дел од најдобрите студенти на ФИНКИ. Дипломира во 2018 год. со просечна оцена 9,70, со дипломски труд на тема „Креирање описи на медицински слики со техники на\nдлабоко учење“. Во 2018 год. се запишала на постдипломските студии на Факултетот за информатички науки и компјутерско инженерство во Скопје на насоката Интелигентни системи. Магистрира во 2019 год. со просечна оцена 10,00, со магистерски труд на тема „Автоматско креирање на стилизиран текст со длабоки невронски архитектури“. Во 2020 год. се запишала на докторските студии на Факултетот за информатички науки и компјутерско инженерство во Скопје на насоката Компјутерски науки и инженерство.\nВо текот на студирањето изведувала практична работа како практикант за машинско учење во „Netcetera“. Во 2017 год. е избрана за демонстратор на Факултетот за информатички науки и компјутерско инженерство во Скопје, а во 2022 год. го стекнала звањето асистент-докторанд. Во нејзините наставни обврски била/е одговорна за изведување аудиториски и лабораториски вежби по предметите: Вештачка\nинтелигенција, Бази на податоци, Обработка на природни јазици, Интелигентни информациски системи, Агентно-базирани системи, Откривање знаење со длабоко учење, Виртуелни општества, Теорија на графови и социјални мрежи, Методологија на истражување во ИКТ и Објектно ориентирана анализа и дизајн.\nАвтор е на повеќе научни трудови објавени на домашни и меѓународни конференции. Полињата на нејзиниот научно-истражувачки интерес вклучуваат: вештачка интелигенција, длабоко учење, обработка на природни јазици, анализа на граф податоци, машинска визија, податочно рударење, бази на податоци и др.\n.",
  "consultative_terms": "Редовни консултацииДополнителни консултации Датум: 20-05-202516:00 - 18:00Училница: АНЕКС ФЕИТДен: среда14:00 - 16:00Училница: АНЕКС ФЕИТДен: четврток14:00 - 16:00Училница: АНЕКС ФЕИТ"
},
{
  "name": "м-р Војдан Ќорвезироски",
  "description": "Роден е 1996 година во Скопје, каде што ги завршил основното и средното образование. Дипломирал на Факултетот за информатички науки и компјутерско инженерство во Скопје во 2019 година на насоката Мрежни технологии. Запишан е на магистерски студии во 2019 година, насока Интернет технологии. Во текот на додипломските студии бил континуирано наградуван за постигнатите резултати. Учествува во реализација на два меѓународни проекта. На Факултетот за информатички науки и компјутерско инженерство во Скопје почнал да работи во 2018 година како помал демонстратор. Неговите наставни обврски опфаќаат изведување на аудиториски и лабораториски вежби по предметите од областа на компјутерските мрежи и сајбер безбедноста. Области на научно-истражувачки интерес се компјутерски мрежи, дистрибуирани системи, апликативен софтвер и сајбер безбедност.\n.",
  "consultative_terms": "Редовни консултацииДен: среда14:00 - 16:00Училница: Ф13Ден: четврток08:00 - 10:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Александар Стојменски",
  "description": ".",
  "consultative_terms": ""
},
{
  "name": "м-р. Александар Тенев",
  "description": "Роден е 1988 година во Струмица. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2010. Запишан е на магистерски студии на истиот факултет во 2010. Магистерските студии му се од областа на биоинформатика. Во текот на факултетското образование бил постојано наградуван за постигнатиот успех во студирањето. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи во 2009 година како демонстратор. Неговите обврски околу наставата опфаќаат изведување аудиториски и лабораториски вежби по предмети од областа на структурирано програмирање, објектно-ориентирано програмирање, вовед во интернет и програмски методологии. Области на неговиот научно-истражувачки интерес се машинско учење и вештачка интелигенција, невронаука (функционална и анатомска конективност кај човековиот мозок) и биоинформатика (структура на ДНК и протеински интеракции).\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник08:00 - 11:00Училница: ТМФ 200аДен: среда07:00 - 09:00Училница: 315, Online"
},
{
  "name": "д-р Бојан Илијоски",
  "description": "Бојан Илијоски е роден во 1987 во Скопје. Основно образование завршил во ОУ ,,Мирче Ацев” во Скопје, а средно образование во гимназија ,,Никола Карев” во Скопје, математичко подрачје. Во текот на основното и средното образование учествувал на регионални и државни натпревари по математика и информатика.Во 2006 година се запишал на Природно-математичкиот факултет во Скопје, на институтот за информатика, насока програмско инженерство. Дипломирал во 2010 при што се стекнaл со стручен назив димпломиран инженер по информатика – програмско инженерство. За време на високото образование учествувал на повеќе натпревари во програмирање и кострукција и менаџирање на софтверски проекти. Во септември 2010 се запишaл на постдиплмоските студии при Институтот за информатика на Природно-математичкиот факултет, насока компјутерски науки. Магистрирал во декември 2013 на тема „Групирање на коментари на македонски јазик“ кај менторот проф.д-р. Жанета Попеска. Од 2009 е активен како демонстратор на Интитутот за информатика при Природно-математичкиот факултет, со задолжение за држење на лабораториски вежби по предметите основи на програмирање, објектно и визуелно програмирање, структури на податоци и алгоритми, структури на податоци, интернет технологии и интеракција човек-компјутер. Области на неговиот научно-истражувачки интерес се интелигентни системи, податочно рударство, рударење низ текст, бази на податоци, алгоритми, грид пресметување, пресметување со високи перформанси.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник10:00 - 12:00Училница: Online (Courses - Консултации), OnlineДен: четврток12:00 - 14:00Училница: ТМФ 35"
},
{
  "name": "д-р Костадин Мишев",
  "description": "Роден е 1990 година во Скопје. Основно и средно образование завршил во Неготино. Во текот на средното образование освојува бројни награди на државни натпревари по информатика, физика и математика. Дипломира во 2013 година на Факултетот за информатички науки и компјутерско инженерство на смерот Информатика и компјутерско инженерство (ИКИ) со просек 9.72. Во текот на студирањето континуирано е наградуван за успешно студирање. Во 2016 година, на Факултетот за информатички науки и компјутерско инженерство ја одбранил магистерската теза и се стекнал со звањето магистер по информатички науки и компјутерско инженерство од областа на компјутерските мрежи и е-технологиите. На докторски студии се запишува во септември 2017 на смерот Компјутерски науки на Факултетот за информатички науки и инженерство.\nВо периодот од 2014 до 2017 работи како софтверски инженер во Компјутерски центар на ФИНКИ, а дополнително е ангажиран и како демонстратор на повеќе предмети. Во декември 2017 е избран за асистент-докторанд на ФИНКИ. Неговите наставни обврски опфаќаат работа на предмети од областа на Оперативни системи, Компјутерски мрежи, Веб програмирање, Електронска и мобилна трговија, Архитектура и организација на компјутери и Мобилни платформи и програмирање.\nВо својата досегашна кариера има учествувано во бројни софтверски и истражувачки проекти. Во рамките на досегашната научно-истражувачка работа има објавено неколку научни трудови како автор и коавтор. Активно работи во областа на машинско учење и длабоки невронски мрежи за обработка на природни јазици во податоци од областа на финансиите и медицината.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток14:00 - 16:00Училница: Online (Courses - Консултации), OnlineДен: среда10:00 - 11:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "Ненад Анчев",
  "description": "Ненад Анчев е роден 1990 година во Штип. Основно образование завршува во ОУ Гоце Делчев како првенец на генерацијата. Средното образование го завршува во Гимназија Славчо Стојменски, со бројни учества и награди на натпревари по информатика, математика и физика, меѓу кои и учество на меѓународната олимпијада по информатика во Египет во 2008 година. Дипломира на ФИНКИ во 2013 на насока компјутерски архитектури и мрежи со просек 9,72 на тема „Анализа на техники за оптимизација и паралелизација на алгоритам за множење на матрици“. Во учебната 2012/13 година помага при изведување на лабораториските вежби на ФИНКИ по предметите концепти за развој на софтвер и архитектура на компјутери. Дел од магистерските студии ги следи на универзитетот RWTH Aachen во Германија на програмата за симулациски науки, како стипендист на DAAD. Таму во 2014 и 2015 работи како помлад истражувачки асистент на Julich Aachen Research Alliance во одделот за пресметување со високи перформанси. Во периодот од 2016-2018 работи во Сорсикс во тимот за податочни науки и анализа на податоци. Од 2019 е ангажиран на ФИНКИ како демонстратор за изведување на аудиториски и лабораториски вежби по неколку предмети. Магистерската теза ја работи на тема „Адаптивни модели за симулација на аерозагадување“. Ненад покажува особен интерес во областите на пресметување со високи перформанси, алгоритми, моделирање и симулации, како и областа на податочни науки.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник18:00 - 20:00Училница: M11, OnlineДен: четврток12:01 - 14:00Училница: M11, Online"
},
{
  "name": "д-р Илинка Иваноска",
  "description": "Родена е 1986 година во Скопје. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2009. Во моментов е запишана на магистерски студии на истиот факултет на насоката Содржинско базирано пребарување. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Како студент во 2005 година е добитник на наградата “13 Ноември” од град Скопје за постигнати забележителни успеси во образованието. Таа своето прво работно искуство го стекнала во друштвото за информатички услуги “Некстсенс“ доо. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2009 година како демонстратор. Во моментов е вклучена во изведување вежби по предметите од областа на алгоритми и структури на податоци, објектно ориентирани системи, информациони системи, објектно ориентирана анализа и дизајн и интелегентни информациони системи. Области на нејзин научно-истражувачки интерес се вештачка интелигенција, биоинформатика, податочно рударење, машинско учење, бази на податоци.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник17:00 - 19:59Училница: Online (Courses - Консултации), OnlineДен: четврток11:40 - 12:40Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Бобан Јоксимоски",
  "description": "Роден е 1986 година во Скопје. Дипломирал на Факултетот за електротехника и информациски технологии во 2008 година. Моментално е запишан на магистерски студии на студиската програма Софтверско инженерство на истиот факултет. По дипломирањето кратко работел како соработник на Факултетот за информатика при Европскиот универзитет и како 2Д/3Д компјутерски аниматор, веб и апликациски програмер. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи во 2009 год. како демонстратор. Одговорен е за изведување на аудиториски и лабораториски вежби по предметите од областа на структурирано програмирање, објектно-ориентирано програмирање, компјутерска графика, веб дизајн и компјутерска анимација. Член е на IEEE. Области на негов научно-истражувачки интерес се компјутерска графика, визуелизација, географски информациони системи и примена на информациски системи во медицината.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток13:30 - 15:00Училница: Ф14, OnlineДен: среда13:30 - 15:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Емил Станков",
  "description": ".",
  "consultative_terms": "Редовни консултацииДен: понеделник16:00 - 18:00Училница: Online (Courses - Консултации), OnlineДен: среда15:00 - 17:00Училница: ТМФ 320"
},
{
  "name": "д-р Александра Дединец",
  "description": "Родена е 1987 година во Белград, Р Србија. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2009 година на насоката Информатика и компјутерско инженерство. Магистрирала на истиот факултет во 2011 година на насоката Компјутерски мрежи и е-технологии, со магистерска теза од областа на моделирање и анализа на сложени мрежни системи. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Учествува во реализација на еден меѓународен проект и има презентирано труд на меѓународна конференција и учествувала на две меѓународни работилници. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2009 година како демонстратор. Нејзините наставни обврски опфаќаат изведување на аудиториски и лабораториски вежби по предметите од областа на логички кола и дискретни автомати и формални јазици. Области на нејзин научно-истражувачки интерес се оптимизација, анализа и моделирање на мрежни системи, формални јазици, логички кола и дискретни автомати, надежност на системи.\n.",
  "consultative_terms": "Редовни консултацииДен: петок13:00 - 15:00Училница: АНЕКС ФЕИТДен: вторник12:00 - 14:00Училница: АНЕКС ФЕИТ, Online"
},
{
  "name": "д-р Владимир Здравески",
  "description": "Роден е 1988 година во Прилеп. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2010 година. Во текот на студирањето континуирано е наградуван за успешно студирање. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2010 година како демонстратор. Неговите наставни обврски опфаќаат подготовка и изведување на аудиториски и лабораториски вежби за предмети од областа на компјутерски мрежи, мрежни оперативни системи, WAN компјутерски мрежи и безжични компјутерски мрежи. Учествувал во неколку меѓународни проекти. Во рамките на досегашната научно-истражувачка работа има објавено два научни трудови и коавтор е на една книга. Негови активни полиња на научен интерес се: дизајн на дигитални системи со HDL, семантичкиот веб, веб базирани системи, системски софтвер и компјутерски мрежи.\n.",
  "consultative_terms": "Редовни консултацииДен: среда10:00 - 12:00Училница: M7, OnlineДен: понеделник18:00 - 19:59Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Методија Јанчески",
  "description": ".",
  "consultative_terms": "Редовни консултацииДен: четврток08:00 - 10:00Училница: ТМФ 322Ден: петок08:00 - 10:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Ристе Стојанов",
  "description": "Роден е 1985 година во Штип. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година, на насоката информатика и компјутерско инженерство. Магистрирал на истиот факултет во 2010 година, со магистерска теза од областа на семантички веб технологии. Во текот на факултетското образование редовно бил наградуван за успешните студии. Првото работно искуство му било во дооел “Генреп” од 2008 година. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи од 2009 година како демонстратор. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на системски софтвер, мрежно програмирање и мрежен софтвер. Во рамките на досегашната научно-истражувачка работа има објавено десет научно-истражувачки трудови. Коавтор е на една книга. Полињата на научно-истражувачки интерес вклучуваат шеми за дизајн, семантички веб, паралелно процесирање, дистрибуирани системи, компјутерски мрежи, обработка на неструктурирани податоци.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток19:00 - 19:59Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Моника Симјаноска",
  "description": "Родена е во 1988 година во Загреб, Р. Хрватска. Дипломирала во 2012 година на Институтот за информатика при Природно-математичкиот факултет во Скопје, по што истата година се запишала на магистерски студии на Факултетот за информатички науки и компјутерско инженерство во Скопје на насоката интелигентни системи. Магистерската теза со наслов „Бајесова класификација на генска експресија кај колоректален канцер добиена со технологија на ДНК микрополиња имплементирана како SaaS во Облак “ ја одбранила во 2013 година и се стекнала со звањето магистер по информатички науки и компјутерско инженерство од областа интелигентни системи.\nНа докторски студии се запишала во септември 2014 и во 2019 година ја одбранила докторската дисертација со наслов „Процесирање биоелектрични и биоакустични сигнали за предвидување медицински состојби“, стекнувајќи се со научен степен - доктор по информатички науки.\nОд 2010 е ангажирана како демонстратор, прво на Институтот за информатика при ПМФ, а потоа и на ФИНКИ. Краток период работи како асистент на Универзитетот „Гоце Делчев“ во Штип. Од декември 2017 година работи на ФИНКИ. Во текот на работењето, активно е вклучена во неколку национални и меѓународни проекти. Добитник е на награда за најдобар труд презентиран на 25. симпозиоум DAAAD во Виена, Австрија, како и на FESTO-наградата за млад научник. Во повеќе наврати остварува научен престој на Институтот „Јожеф Стефан“ во Љубљана, Словенија, каде има прилика да работи во областа на развивање методи за обработка на биомедицински сигнали. Кратки студиски престои има и на UGA во Гренобл, Франција и на UCD во Даблин, Ирска. Автор и коавтор е на повеќе од 50 трудови, објавени на конференции и во признати меѓународни журнали.\nВоглавно нејзиниот интерес е насочен кон развој на интелигентни системи во различни области како: процесирање на биомедицински сигнали, биоинформатика, пресметување во облак, биосензори, обработка на природни јазици, а во поново време и во роботика и микропроцесорски системи како дел од нејзиниот наставен ангажман.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток14:00 - 16:00Училница: M2, OnlineДен: вторник14:00 - 15:00Училница: M2"
},
{
  "name": "д-р Бојана Котеска",
  "description": "Бојана Котеска дипломирала на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ) во Скопје во 2011 година на насоката софтверско инженерство со просечен успех 9.87, како најдобар студент во својата генерација. Добитник е на наградата „Златник“ од Универзитетот „Св. Кирил и Методиј“ и „Златен прстен“ од организацијата на инженерите на Македонија. Во 2012 година ја одбранила магистерската тема и се стекнала со научното звање магистер по информатички науки од областа на софтверското инженерство. Докторската дисертација ја одбранила во 2018 година под менторство на проф. Анастас Мишев на Факултетот за информатички науки и компјутерско инженерство.\nВо 2010 година е избрана за демонстратор на Институтот за информатика при Природно математичкиот факултет во Скопје, а во 2011 година на Факултетот за информатички науки и компјутерско инженерство. Во 2017 година е избрана за асистент-докторанд, во 2018 година се стекнува со титулата доцент, а во 2023 е избрана за вонреден професор на Факултетот за информатички науки и компјутерско инженерство. Изведува/ла настава по повеќе предмети на прв и втор циклус меѓу кои и: Алгоритми и податочни структури, Софтверски квалитет и тестирање, Објектно-ориентирана анализа и дизајн, Вовед во компјутерски науки, Управување со процесот на тестирање на софтвер, Тестирање на софтвер за пресметување со високи перформанси, Бази на податоци, Менаџмент на информациски системи, Софтверско инженерство.\nУчествува/ла во 15 меѓународни и 20 домашни научно-истражувачки проекти како истражувач, меѓу кои и на три како раководител. Во рамките на досегашната научно-истражувачка работа има објавено над 80 научни трудови во списанија и домашни и меѓународни конференции како автор и коавтор. Коавтор е на две книги. Полињата на нејзиниот научен интерес се квалитет на софтвер, процесирање на биомедицински сигнали, биосензори и машинско учење.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник12:00 - 14:00Училница: M2Ден: понеделник12:00 - 14:00Училница: Online (Courses - Консултации)"
},
{
  "name": "д-р Катарина Тројачанец Динева",
  "description": "Родена е 1986 година во Куманово. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2008 год. Магистрирала на истиот факултет во 2010 година, со магистерска теза од областа на содржински базирано пребарување на слики од магнетна резонанца. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Како најдобар студент од генерацијата е наградувана од Факултетот, универзитетот “Св. Кирил и Методиј”, како и други фондации и е добитник на инженерски прстен од Организацијата на инженерите на Македонија. Таа своето прво работно искуство го стекнала на Европскиот универзитет на Факултетот за информатика во 2008 година. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2008 година како демонстратор. Во моментот е одговорна за изведување на аудиториските и лабораториските вежби по предмети од областа на структурирано програмирање, објектно-ориентирано програмирање, интернет програмирање и кориснички интерфејси. Области на нејзин научно-истражувачки интерес се обработка на слики, податочно рударење, машинско учење, софтверско инженерство.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник12:00 - 14:00Училница: Online (Courses - Консултации), OnlineДен: петок09:00 - 11:00Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Петре Ламески",
  "description": "Роден е 1985 година во Кавадарци. Во 2008 година дипломирал на Факултетот за електротехника и информациски технологии во Скопје. Магистрирал на истиот факултет во 2010 година, со магистерска теза од областа на роботиката. Во текот на студирањето бил редовно на градуван за успешните студии. Од 2008 година работи на Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје како демонстратор. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на роботика, дистрибуирани компјутерски системи, вештачка интелигенција, алгоритми за анализа на податоци, информациони системи и мобилни информациони системи. Области од научно-истражувачки интерес му се машинска интелигенција и учење, интелигентни мобилни роботи, анализа на временски серии на податоци и когнитивни системи.\n.",
  "consultative_terms": ""
},
{
  "name": "д-р Ефтим Здравевски",
  "description": "Роден е 1984 година во Радовиш. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. Магистрирал на истиот факултет на насоката Интелигентни информациони системи во 2010 година, со магистерска теза од областа на податочно рударење. Во текот на студирањето континуирано е наградуван за успешно студирање. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2010 година како демонстратор. Неговите наставни обврски вклучуваат подготовка и изведување на аудиториски и лабораториски вежби по предмети од областа на дистрибуирани компјутерски системи, алгоритми за анализа на податоци и интелигентни информациони системи, додека неоговото практичното искуство се состои од дизајн и имплементација на разновидни софтверски решенија стекнати при работењето во НИ ТЕКНА – Интелигентни технологии. Член е на Менса Македонија од 2004 година. Во рамките на досегашната научно-истражувачка работа има објавено десетина научни трудови на меѓународни конференции. Негови активни полиња на научен интерес се: машинско учење, податочно рударење, експертни системи, системи за поддршка на одлуки, интелигентни информациони системи, бази и складишта на податоци, безжични сензорско-акторски мрежи и други.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник15:00 - 16:30Училница: Online (Courses - Консултации), OnlineДен: среда08:00 - 10:00Училница: ТМФ 119"
},
{
  "name": "д-р Иван Китановски",
  "description": "Роден е 1986 година во Битола. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2009 год. Во моментов е запишан на магистерски студии на истиот факултет. Во текот на факултетското образование бил континуирано наградуван за успешното студирање. Своето прво работно искуство го стекнал во “T-Mobile” во 2008, каде работел како програмер. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи од 2009 година како демонстратор. Во моментов е одговорен за изведување на аудиториските и лабораториските вежби по предметите од областа на интернет програмирање и визуелизација. Области на неговиот научно-истражувачки интерес се обработка на слики, податочно рударење, машинско учење, софтверско инженерство.\n.",
  "consultative_terms": "Редовни консултацииДен: среда13:30 - 15:30Училница: Online (Courses - Консултации), OnlineДен: вторник10:30 - 12:30Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Милош Јовановиќ",
  "description": "Роден е 1985 година во Куманово. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година на насоката Информатика и компјутерско инженерство. Магистрирал на истиот факултет во 2010 година на насоката Компјутерски мрежи и е-технологии, со магистерска теза од областа на семантички веб технологии. Во 2016 година докторирал на Факултетот за информатички науки и компјутерско инженерство, на насоката Компјутерски науки и инженерство, со докторска дисертација од областа на поврзани податоци. Во текот на студирањето континуирано е наградуван за успешно студирање.\nНа Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2008 година како демонстратор. Во 2011 година е избран за помлад асистент на Факултетот за информатички науки и компјутерско инженерство, а во 2014 година за асистент. Во 2017 година е избран за доцент, а во 2022 година за вонреден професор на Факултетот за информатички науки и компјутерско инженерство. Неговите наставни обврски опфаќаат работа на предмети од областа на оперативни системи, електронска и мобилна трговија, менаџмент информациски системи, DevOps и веб базирани системи.\nУчествувал во 9 меѓународни и 26 домашни научно-истражувачки проекти. Во рамките на досегашната научно-истражувачка работа има објавено околу 60 научни трудови како автор и коавтор. Коавтор е на три книги. Негови активни полиња на научен интерес се графови на знаење, поврзани податоци, наука за податоци, отворени податоци и семантички веб технологии.\n.",
  "consultative_terms": ""
},
{
  "name": "д-р Андреја Наумоски",
  "description": "д-р Андреја Наумоски дипломирал и магистрирал  во 2006 и 2008 година, соодветно,додека во јули 2012 успешно ја одбранил докторската теза на Факултетот за информатички науки и компјутерско инженерство во Скопје. Од 2006 година, работи на неколку меѓународни проекти на Факултетот како истражувачки асистент, додека во 2009 година е ангажиран како демонстратор при Факултетот за електротехника и информациски технологии во Скопје. На Факултетот за информатички науки и компјутерско инженерство во Скопје во 2011 година е ангажиран како демонстратор, додека во јануари 2014 е избран во звањето насловен доцент. Наставните обврски му опфаќаат изведување предавања и аудиториски вежби по неколку предмети. Автор и коавтор е на повеќе од четириеесет научни трудови на меѓународни  конференции и престижни странски списанија, како и меѓународни списанија со фактор на влијание. Учествувал во 3 меѓународни проекти финансирани од Темпус и FP6 програмата, како и на билатерални проекти. Полиња на научно - истражувачки интерес му се машинско учење и податочно рударење на еколошки податоци, моделирање и предикција на динамички процеси, фази логика и фази машински алгоритми, како и анализа на временски серии.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник08:00 - 10:00Училница: Online (Courses - Консултации), OnlineДен: вторник14:00 - 16:00Училница: Електротехника"
},
{
  "name": "д-р Христина Михајлоска",
  "description": "Христина Михајлоска е родена 1985 година во Охрид, Македонија. Дипломирала на Природно-математички Факултет, Институт за Информатика во Скопје, во 2008 година. Во 2011 година се здобила со титулата магистер по информатички науки при Факултетот за Информатички науки и компјутерско инженерство (ФИНКИ) во Скопје на насоката ТЕМПУС - Софтверско инженерство. Нејзината магистерска тема е од областа на симетричната криптографија и е со наслов “Анализа и конструкција на оптимални супституциски табели кај блок шифрувачи со помош на квазигрупи” под менторство на Данило Глигороски, редовен професор на Норвешкиот универзитет за наука и технологии (NTNU) во Трондхејм, Норвешка. Во март 2017 година, докторирала на Факултетот за Информатички науки и компјутерско инженерство (ФИНКИ) во Скопје, со докторска дисертација од областа на криптографијата под наслов “Лесна криптографија од перспектива на теоријата на квазигрупи” под менторство на проф. Глигороски.\nВо текот на своите студии, континуирано е наградувана за постигнатиот успех.\nПо дипломирањето е вработена како помлад асистент на Природно-математичкиот Факултет, Институт за Информатика во Скопје. Од 2011 година, работи како асистент на Факултетот за Информатички науки и компјутерско инженерство (ФИНКИ) во Скопје. Нејзината работа како асистент вклучува подготовка и изведување на аудиториски и лабораториски вежби по предмети како што се: програмирање, алгоритми и податочни структури, оперативни системи, квалитет на софтвер и тестирање, криптографија и информациска безбедност.\nУчествува/ла во повеќе меѓународни и домашни научно-истражувачки проекти. Во рамките на нејзината научно-истражувачка работа има учествувано на голем број конференции, работилници и летни школи. Автор и коавтор е на бројни научно-истражувачки трудови. Има учествувано на светскиот натпревар за автентикациска енкрипција CAESAR како дел од тимот на шифрувачот π-Cipher. Моментално нејзиното внимание е насочено кон автентикациска енкрипција, дизајн на лесни шифрувачи и докажлива сигурност како дел од полето на симетричната криптографија.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток13:00 - 15:00Училница: M1Ден: вторник10:00 - 12:00Училница: M1, Online"
},
{
  "name": "д-р Панче Рибарски",
  "description": "Роден е 1984 година во Штип. Основно училиште до четврто одделение завршил во Радовиш, а потоа основно и средно во Скопје. Во 2003 година се запишал на студии по информатика на Природно математички факултет во Скопје, кои ги завршил во 2008 година. Во последните две години од студирањето бил примен како демонстратор на Институтот за информатика. Во 2008 година бил избран како асистент на Факултетот за информациски технологии МИТ во Скопје. Во 2009 година бил избран како соработник на Институт за информатика при Природно математички факултет во Скопје. Во рамките на наставниот процес на институтот учествува како соработник во изведувањето на наставата во следните предмети: Структури на податоци, Мрежни оперативни системи, Безбедност и криптографија, Безжични и мобилни технологии, Управување на софтверски проекти, Дизајн и архитектура на софтвер, Оперативни системи и Анализа на софтверски потреби. Теми на истражување на Панче Рибарски се примена на безбедност и криптографија во софтверското инженерство со посебен осврт на системи за електронско гласање. Покрај тоа особен интерес има во полето на мобилните технологии и нивната примена сеприсутност во секојдневниот живот. Панче Рибарски е автор на неколку трудови во областа на криптографија, електронска сигурност и системи за електронско гласање. По дипломирањето е запишан на последипломски студии на TEMPUS програмата за Софтверско инженерство. Ги има завршено обврските со понудените предмети и моментално спрема магистерска теза во полето на криптографија и системи за електронско гласање. Член е на Здружението на информатичари на Македонија и е секретар на Асоцијација ИКТ-АКТ Скопје.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток09:00 - 11:00Училница: ТМФ 26Ден: вторник09:00 - 11:00Училница: ТМФ 26"
},
{
  "name": "д-р Наташа Илиевска",
  "description": "Родена е 1978 година. Основно и средно образование завршила во Скопје со одличен успех. На Природно-математичкиот факултет во Скопје на Институтот по информатика, применета насока, се запишала во академската 1996/97 година. Дипломирала во 2001 година, со среден успех 9.94, како најдобар дипломиран студент во генерација на Институтот за информатика, стекнувајќи се со звање дипломиран инженер по информатика. На постдипломски студии по математика се запишала во академската 2002/2003 година, а ги завршила во 2009 со одбрана на магистерскиот труд “Кодови за откривање грешки и примена на квазигрупи за нивно дизајнирање”. Докторската дисертација од областа на теоријата на кодирање ја одбранила во 2015 на Факултетот за информатички науки и компјутерско инженерство - ФИНКИ.\nВо зимскиот семестар во академската 2001/2002 година била демонстратор, во 2002 година била избрана за помлад асистент, а во 2009 за асистент на Институтот за информатика при ПМФ. Од 2011 до 2015 била асистент на Факултетот за информатички науки и компјутерско инженерство - ФИНКИ, а во 2015 е избрана во доцент на истиот факултет. Има држено вежби по дваесетина предмети од различни области на студентите на ФИНКИ, како и на студентите на Институтот за информатика и Институтот за математика при ПМФ, Скопје: дискретна математика 1, дискретна математика 2, веројатност и статистика, дискретни структури 1, дискретни структури 2, дискретни структури 3, веројатност, теорија на веројатност, алгебра, алгебарски дискретни структури, множества и логика, линеарна алгебра, вектори и матрици, теорија на информации, основи на теорија на информации, основи на програмирање, бази на податоци, математички методи за информатичари, математичка статистика, функции со повеќе променливи, математичка анализа, програмирање на сметачки машини, компјутерски практикум II, компјутерски практикум III. Како наставник држи предавања по Дискретна математика 1, Дискретна математика 2 и Веројатност и статистика на студентите на ФИНКИ. Има напишано неколку скрипти достапни за студентите во електронска форма преку соодветни web страни. Учествувала на дваесетина конгреси, конференции, работилници, школи и курсеви во земјата и странство. Била учесник во неколку научно-истражувачки проекти и е автор повеќе научни труда.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток08:00 - 10:00Училница: Online (Courses - Консултации), OnlineДен: понеделник12:00 - 14:00Училница: Online (Courses - Консултации)Ден: понеделник14:00 - 16:00Училница: ТМФ 322"
},
{
  "name": "д-р Билјана Тојтовска",
  "description": "Родена е 1980 година во Скопје. Основно и средно училиште завршила во Скопје. Била член на Македонскиот тим на Меѓународните математички олимпијади за средношколци. Учествувала на повеќе Балканијади и Светски олимпијади на кои освоила пофалници и два бронзени медали. Во 1999 се запишала на студиите по теориска математика на Природно математичкиот факултет во Скопје. Дипломирала во 2004 со просек 9.88. Како стипендист на DAAD продолжила на Магистерски студии по Стохастика и финансиска математика на Техничкиот Универзитет Кајзерслаутерн во Германија. Во 2007 година под менторство на проф. Ralf Korn ја комплетирала магистерската теза под наслов “Martingale decompositions with application in Finance” за која добила оценка 10. Студиите ги завршила со просек 10 и за резултатите постигнати за време на магистерските студии добила признание за најдобар студент на институтот по Математика. За време на својот престој во Германија работела и на проектот “ Asset liability managment” во рамките на институтот ITWM Fraunhofer. Учествувала на различни семинари меѓу кои и работилницата организирана од Credit Suisse, во Frankfurt на тема “Equity derivatives. По враќањето во Македонија работела во Министерството за финансии во одделот за истражување при Секторот за јавен долг на Р. Македонија. Својот ангажман на Институтот за Информатика го започнува во 2009 година, кога и е избрана за помлад асистент. Изведува настава по повеќе предмети: Линеарна алгебра, Дискретни структури, Калкулус, Веројатност и статистика, Теорија на информации, Опрациони истражувања, Нумеричко сметање. Дел од нејзините научни интереси се веројатност и статистика, стохастички диференцијални равенки и стохастичко моделирање со акцент на нивната примена во други области ( биологија, медицина, финансии, информатика ). Во рамките на своето докторско истражување работи под менторство на проф. Светлана Јанковиќ на тема \"Стаболност на модели на стохастички невронски мрежи\". Има објавено неколку трудови и учествувано со свои презентации на повеќе меѓународни семинари, конференции и работилници. Дел е од организацијата на натпреварите по математика во Република Македонија.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток13:00 - 15:00Училница: M2Ден: петок13:00 - 14:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Александра Поповска Митровиќ",
  "description": "Александра Поповска-Митровиќ е родена 1979 година во Скопје. Дипломирала и магистрирала во 2003 и 2009 година на Институтот за информатика при Природно-математичкиот факултет во Скопје. Во 2014 година ја одбранила својата докторска теза од областа на теорија на кодирање и криптографија на Факултетот за информатички науки и компјутерско инженерство. Во 2004 година добива награда од Универзитетот „Св. Кирил и Методиј во Скопје за дипломирање со највисок просек на Природно-математичкиот факултет во учебната 2002/03 година.\nВо 2002 година почнала да работи на Институтот за информатика, Природно-математички факултет, како демонстратор, а во 2006 година како помлад асистент. Во 2011 година продолжува да работи како асистент на Факултетот за информатички науки и компјутерско инженерство. Во периодот од 2015 – 2019 година работи како доцент, 2019 – 2024 година како вонреден професор, а од мај 2024 година како професор на Факултетот за информатички науки и компјутерско инженерство, Универзитет „Св.Кирил и Методиј“ во Скопје.\nБила учесник/раководител на повеќе меѓународни и национални научни проекти. Автор е на повеќе научни трудови објавени во списанија и зборници на меѓународни конференции. Нејзини области на истражување се: теорија на кодирање, криптографија, теорија на информации, blockchain технологија.\n.",
  "consultative_terms": "Редовни консултацииДен: среда10:00 - 11:30Училница: Online (Courses - Консултации), OnlineДен: четврток11:00 - 13:00Училница: M12"
},
{
  "name": "д-р Магдалена Костоска",
  "description": "Родена е 1982 година во Гостивар.Основно училиште завршила во ОУ„Братство-Единство“, Гостивар, а средно училиште во „Раде Јовчевски – Корчагин-ПЕКСНАС“ во Скопје, како ученик на генерација. Дипломирала на Природно-математички факултет на Институт за Информатика во Скопје 2006 година, со дипломска работа на тема „ Веб апликација за on-line пријавување на проекти “ под менторство на проф. Д-р Марјан Гушев, притоа завршувајќи ги своите студии со просек 9,7. 2007 година се запишува на последипломските студии на Природно-Математичкоти Факултет, на насоката Софтверско Инженерство. За време на студиите (од 2001 година до 2005 година) добила признанија и пофалби за натпросечно остварување во првата, втората, третата и четвртата студиска година од факултетското образование. Од 2005 до 2007 работи како демонстратор на Институтот за Информатика и паралелно од 2006 до 2007 работи и во компанијата Ултра во Скопје. Притоа работи на проекти како: банкарски информационен систем, трезорски информационен систем, осигурителен информационен систем и billing систем. Уште во финалната година на студирање е примена за демонстратор, а во 2007 година е избрана за помлад асистент на ИИ. Магистрирала во 2010 год. на темата \"е-Трезор - ТРЕЗОРСКИ ИНФОРМАЦИОНЕН СИСТЕМ\" и истата година е избрана за асистент на Заводот за програмско инженерство на ИИ при ПМФ. Изведувала вежби по предметите: анализа на софтверски потреби, конструкција на софтвер, дизајн и архитектура на софтвер, структури на податоци, интеракција човек-компјутер, бази на податоци, архитектура на компјутери, безжични и мобилни технологии, управување на софтверски проекти и податочно рударство. Има издадено и учествувано во креирање на повеќе публикации.\n.",
  "consultative_terms": ""
},
{
  "name": "д-р Сашо Граматиков",
  "description": ".",
  "consultative_terms": "Редовни консултацииДен: понеделник12:00 - 14:00Училница: M6, OnlineДен: среда14:00 - 16:00Училница: M6, Online"
},
{
  "name": "д-р Кире Триводалиев",
  "description": "Роден е 1982 година во Струмица. Дипломирал на Електротехничкиот факултет во Скопје во 2006 година. Магистрирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. Во текот на образованието редовно е наградуван за успешно студирање, а како најдобар студент во генерацијата е награден и од универзитетот „Св. Кирил и Методиј“ и други организации и фондации, меѓу кои Организацијата на инженерите на Македонија, која го наградила со наградата златен инженерски прстен. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 2005 година како демонстратор. Во 2007 година го стекнал звањето помлад асистент, а во 2010 година звањето асистент. Во своите наставни обврски бил/е одговорен за изведување вежби по предмети од областа на бази на податоци, вештачка интелигенција, податочно рударење, алгоритми за анализа на податоци, логичко и функционално програмирање и биокибернетика. Како автор/коавтор има учествувано во изработката на повеќе од 15 трудови публикувани во реномирани меѓународни научни списанија и зборници од конференции. Неговиот научно-истражувачки интерес е фокусиран на областите: биоинформатика, пресметковна биологија, вештачка интелигенција, податочно рударење, алгоритми за анализа на податоци и бази на податоци.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток11:00 - 12:30Училница: АНЕКС ФЕИТ, OnlineДен: понеделник11:00 - 12:30Училница: АНЕКС ФЕИТ, Online"
},
{
  "name": "д-р Георгина Мирчева",
  "description": "Родена е 1984 година во Свети Николе. Дипломирала и магистрирала на Факултетот за електротехника и информациски технологии во Скопје во 2007 и 2009 година, соодветно. Во текот на факултетското образование редовно била наградувана за успешните студии. Во 2014 година докторирала на Факултетот за информатички науки и компјутерско инженерство во Скопје.\nНа Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2007 година како демонстратор, а во 2009 година била избрана за помлад асистент. Од 2011 година работи на Факултетот за информатички науки и компјутерско инженерство во Скопје како помлад асистент, а во 2012 година е избрана како асистент. До сега била ангажирана за изведување вежби по повеќе предмети: бази на податоци, бази на податоци 1, вештачка интелигенција, податочно рударење, мултимедиски системи, менаџмент на информациони системи, машинска интелигенција и учење, географски информациони системи, системска анализа и дизајн, објектно ориентирана анализа и дизајн и други.\nВо рамките на досегашната научно-истражувачка работа има објавено над 30 научно-истражувачки трудови во меѓународни списанија и зборници на странски и домашни конференции. Полињата на научно-истражувачки интерес вклучуваат биоинформатика, пресметковна биологија, вештачка интелигенција, податочно рударење, мултимедиа, машинско учење и бази на податоци.\n.",
  "consultative_terms": "Редовни консултацииДен: среда16:00 - 17:30Училница: АНЕКС ФЕИТДен: четврток18:00 - 19:30Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Мирослав Мирчев",
  "description": "Мирослав Мирчев е роден во 1986 година во Св. Николе. Дипломирал во 2008 година на Факултетот за електротехника и информациски технологии при Универзитетот Св. Кирил и Методиј во Скопје на смерот Информатика и компјутерско инженерство. Магистрирал на истиот факултет во 2009 година на смерот компјутерски мрежи и е-технологии, со магистерски труд на тема “Моделирање на непоасонови процеси на ширењее вируси во компјутерски мрежи” под менторство на акад. проф. д-р Љупчо Коцарев. Во 2007 година почнал да работи како демонстратор на Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје, а во 2010 бил избран за помлад асистент. Во 2010 година бил на неколку месечен научно истражувачки престој на City University во Хонг Конг. Во 2011 започнал докторски студии на Политехничкиот универзитет во Торино, а во текот на докторските студии остварил и шестмесечен престој на Универзитетот на Калифорнија, Сан Диего во САД и еднотримесечен престој на институтот Јожеф Штефан во Љубљана. Докторските студии ги завршил во 2014 година, со одбрана на докторската теза со наслов “Кооперативни процеси во комплексни мрежи со несовршености” под менторство на проф. д-р Марио Биеј, проф. д-р Фернандо Коринто и акад. проф. д-р Љупчо Коцарев. Во 2014 година е избран за доцент на Факултетот за информатички науки и компјутерско инженерство во Скопје, а во 2019 и за вонреден професор на истиот факултет. Негови полиња на научно-истражувачка работа се мрежна наука, комплексни системи, машинско учење, вештачка интелигенција, компјутерски мрежи, оптички мрежи, итн. Досега има објавено голем број на научно-истражувачки трудови во реномирани меѓународни списанија и конференции и има учествувано во повеќе меѓународни и национални научно-истражувачки проекти, како и во неколку стручно-апликативни проекти. Бил член во програмски одбор на повеќе меѓународни конференции, и претседавач на една меѓународна конференција.\n.",
  "consultative_terms": ""
},
{
  "name": "д-р Анастас Мишев",
  "description": "Роден e 1971 година во Охрид. Основно и средно училиште завршил во Охрид. Во 1990 година се запишал на Военотехничкиот факултет во Загреб, каде што ја завршил првата година на студиите. Од академската 1991/92 година студиите ги продолжил во Скопје, на ИИ при ПМФ. Студиите ги завршил во 1996 година, со што се стекнал со звањето дипломиран инженер по информатика. По завршувањето на студиите работел како надворешен соработник - програмер во неколку софтверски куќи на развојот на поголеми информациони системи. Во 1997 година го отслужил воениот рок. Во академската 1997/98 година се запишал на постдипломски студии на ИИ, кои ги завршил во 2002 година, со одбрана на магистерскиот труд “Преименување на регистри”, под менторство на проф. д-р Марјан Гушев. Во 2009 година докторирал на тема \"Процесни текови кај грид пресметувањата – управување, извршување и распределување” под менторство на Проф. Д–р Маргита Кон–Поповска. Во 1998 година бил избран за стручен соработник, во 2000 година за помлад асистент, а во 2003 година за асистент во Заводот за програмско инженерство при ИИ. Во 2009 година избран е за доцент на Институтот за информатика. Од 1999 до 2003 година ја извршувал функцијата в.д. раководител на Компјутерскиот центар при ИИ, а во 2005 година е избран за раководител на Компјутеркиот центар на ПМФ. Во 2009 повторно е избран за раководител на Компјутерскиот центар на ИИ, функција што и денес ја извршува.\nРаботи и како инструктор во регионалната CISCO-академија на Институтот за информатика. Држи настава по предметите: Структури на податоци и алгоритми, квалитет на софтвер и тестирање, микропроцесори и микрокомпјутери, проектирање на компјутерски мрежи, безжични мрежи, современи компјутерски системи, напредни алгоритми, грид и научно процесирање, интеграција на системи, софтверско инженерство за критични системи и др. Држел вежби по следниве предмети: архитектура на компјутерите, микропроцесори и микрокомпјутери, програмски јазици, структури на податоци, проектирање компјутерски мрежи, компјутерски мрежи, интернет, интернет-апликации, интерактивни апликации, учење со компјутери, современи компјутерски системи, бази на податоци за студентите по информатика, вовед во информатиката за студентите по географија, вовед во информатиката за студентите од Факултетот за земјоделски науки и храна и од Филозофскиот факултет. Во фокусот на неговите истражувања се инфраструктурите за колаборативно пресметување и истражување, а пред сè грид и системите за пресметување со високи перформанси. Негова цел е овие системи да се доближат кон сите потенцијални корисници, пред сè кон истражувачките заедници, за да може во целост да се искористи огромниот потенцијал што тие го нудат. Истражувал и во областите компјутерските архитектури и мрежи, софтверското инженерство, интернет-технологиите и електронското учење. Учествувал во реализацијата на преку 25 меѓународни проекти, финансирани од ТЕМПУС, ФАРЕ, ДААД и ФП програмата, а поврзани со развојот на информатичката инфраструктура и со информатичкото образование. Во моментов е координатор за Македонија на еден ФП7 проект, поврзан со процесирање со високи перформанси (High Performance Computing) HP-SEE. Автор е на преку 35 научни и стручни трудови објавени во меѓународни списанија и зборници од конференции, а одржал и над 25 презентации на научни и стручни собири и работилници. Член е на неколку здруженија од областа на иформатиката (IEEE, ICT-ACT).\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник10:00 - 12:00Училница: ТМФ 10Ден: среда12:00 - 14:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Горан Велинов",
  "description": "Горан Велинов ја одбранил својата докторска дисертација од областа на Информатички науки во 2008 година (под наслов „Обопштување и подобрување на оптимизациските процеси кај релационите податочни складови“) на Природно – математичкиот факултет на Универзитетот Св. Кирил и Методиј во Скопје. Во 2009 година е избран во насловен доцент на Природно – математичкиот факултет во Скопје, додека во 2010 е избран во доцент на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ), каде што предава Напредни бази на податоци. Тој има објавено бројни трудови во списанија и меѓународни конференции, главно во областа на складови на податоци и оптимизација. Тој има учествувано во неколку меѓународни проекти, како што се ELISA, INTERREG IIIB CADSES, 2006-2008; SEE-GRID, 6FP IST проект, 2004-2006; SEE-GRID2, 7FP IST проект, 2006-2008 и др. Неговите истражувачки интереси се насочени кон дизајн и имплементација на складови на податоци, моделирање на податоци, особено повеќедимензионално моделирање, како и бизнис интелигентни системи.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток10:00 - 12:00Училница: M3Ден: вторник10:00 - 12:00Училница: M3"
},
{
  "name": "д-р Невена Ацковска",
  "description": "Родена e 1975 година во Скопје. Основно и средно училиште завршила во Скопје. Во текот на образованието била добитник на повеќе награди и признанија на регионални и на републички натпревари по биологија и математика. Студиите по компјутерска техника, информатика и автоматика на Електротехничкиот факултет во Скопје ги започнала во учебната 1994/1995 година Академската 1995 година ја следела на Univerity of Massachussetts, Amherst, MA, USA, каде што била на листата на најдобрите студенти. Дипломирала во 2000 година на Електротехничкиот факултет во Скопје со среден успех 9,52. Во 2000 година била примена за демонстратор, во 2001 година е избрана за помлад асистент, а во 2004 година за асистент во Заводот за програмско инженерство на ИИ при ПМФ. Во 2003 година ги завршила постдипломските студии по информатика на ПМФ од областа на вештачките интелигентни системи, со одбрана на магистерскиот труд под наслов “Информациони и управувачки процеси во биолошка клетка”. Се стекнала со степенот доктор на информатички науки во 2008 година со одбрана на докторската дисертација под наслов „Системски софтвер на минимални биолошки системи“. Во 2009 година е избрана за доцент на Институтот за информатика при ПМФ. Држела вежби по десетина предмети за студентите по информатика, а изведувала вежби и за студентите по хемија и математика при ПМФ, на Земјоделскиот факултет во Скопје, како и на Полициската Академија и Универзитетот Американ Колеџ во Скопје. Тековно држи предавања по 7 предмети на Институтот за Информатика на додипломските студии, како и 3 предмети на постдипломските студии. Била соработник во реализацијата на 6 научни проекти. Учествувала на повеќе специјализирачки интернационални школи и курсеви во САД, Германија, Бугарија, Велика Британија и Македонија. Автор е на повеќе од 40 труда, од кои 2 се објавени во списанија, 2 во поглавја од книги а останатите во зборници на трудови од меѓународни или домашни научни конференции. Коавтор е на 2 учебни помагала и еден учебник за програмирање за студентите од информатичките факултети, како и еден учебник по информатика за основното образование. Организатор е на 5 конференции и 2 работлници, а уредник е и на еден зборник на трудови. Нејзини области на истражување се биоинформатиката, роботиката и интелигентните суштества (природни и вештачки). Член е на: IEEE, Здружението на информатичари на Македонија, Центарот за дигитизација на националното наследство при ИИ и Здружението за заштита на децата во Македонија (секретар за меѓународни односи, 1996-1997).\n.",
  "consultative_terms": "Редовни консултацииДен: петок10:00 - 12:00Училница: Online (Courses - Консултации), OnlineДен: вторник12:00 - 14:00Училница: M13"
},
{
  "name": "д-р Марија Михова",
  "description": "Родена 1976 година во Штип. Основно и средно образование завршила во Штип. Добила повеќе награди на натпревари по математика и физика. Дипломирала во 1999 година на студиите по математика на ПМФ, а во 2004 година го одбранила магистерскиот труд на тема “Моделирање надежност на системи со повеќе состојби” и стекнала звање магистер по математички науки. За помлад асистент на ИИ била избрана во 2001 година, а во 2005 година за асистент. На Институтот за информатика држела вежби по предметите: множества, вектори и матрици, диференцијално сметање. интегрално сметање, математичка логика за информатичари, математика 1, дискретни структури и статистика. Држела вежби и по статистика 2 за студентите по математика, математички методи во хемија за студентите по хемија и статистика за студетите по географија. Главно подрачје на нејзин научен интерес е областа надежност на системите. Се интересира и за други подрачја од областа на веројатноста, статистиката, комбинаториката и др. Има објавено 30-тина трудови, а презентирала повеќе од 30 трудови на конференции и работилници. Учествувала во 3 научноистражувачки проекти и во 2 проекта за унапредување на образованието. Членува во Центарот за дигитизација на националното наследство на Македонија, како и во Друштвото на математичарите на Македонија и Друштвото на информатичарите на Македонија. Како активен член на Здружението на Информатичари, од 2001 година, учествувала во организацијата на повеќе регионални и државни натпревари по Информатика и Македонски Олимпијади по Информатика. Во моментов е член на Извршниот одбор на ЗИМ. Исто така била и во организациониот одбор на Балканската Олимпијада по Информатика во 2008 година. Била и лидер на Македонската екипа на две Балкански Олимпијади по информатика во 2008 и 2009 година. Таа е рецензент на учебникот за четврто одделение за основно образование. Марија била и член на Организициониот Одбор на Првата SEEDI Конференција DIGITAL (re-)DISCOVERY of CULTURE (PHYSICALITY OF SOUL) - Playing. Digital. Член е на програмски одбор на две научни конференции и уредник на зборник од трудови на една конференција.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток12:00 - 14:00Училница: ТМФ 34Ден: четврток16:00 - 18:00Училница: Online (Courses - Консултации), OnlineДен: понеделник03:50 - 05:50Училница: ТМФ 34"
},
{
  "name": "д-р Љупчо Антовски",
  "description": "Роден e 1977 година во Скопје. Основно и средно училиште завршил во Скопје. Учествувал на сојузни и на републички натпревари по физика и информатика. Во 1996 година се запишал на Електротехничкиот факултет во Скопје, каде што бил наградуван за одличен успех во сите учебни години. Дипломирал во 2001 година како првенец на насоката компјутерска техника, информатика и автоматика, со среден успех 9.83, на тема “Софтверски пакет за интелигентно фази-логичко управување на термички процеси”. Постдипломски студии запишал во 2001 година на ИИ при ПМФ. Магистрирал со просек 10,00 во 2003 со одбрана на трудот под наслов “Мобилни плаќања“. Во 2005 година е награден со World Summit Award во категорија e-science. Докторирал во Јануари 2008 со докторска дисертација на тема “Нов модел на мобилни и безжични електронски јавни сервиси”. Стручното усовршување го започнал во текот на додипломските студии со престои во фирмите: Сисдата во Будимпешта, МТНет и Форум - ЦСРД во Скопје. Во 2001 година работел во компанијата Пексим на проекти за електронско банкарство. Во 2001 година бил ангажиран на ИИ како демонстратор, а во 2002 година бил избран за помлад асистент. Во 2004 година е избран за асистент во Заводот за програмско инженерство при ИИ. Држи вежби по предметите: Информациски системи, Архитектура на компјутерите, Компјутерски апликации, Интернет-технологии, Интернет, Мултимедија,Програмски јазици, Вовед во информатиката, Информатика - за студенти по социјална политика и работа. Во 2008 година е избран за доцент на ПМФ. Во 2012 е избран за вонреден професор на ФИНКИ. Тој е одговорен наставник за додипломските предмети: Анализа на софтверски потреби, Конструкција на софтвер, Е-бизнис архитектури и дизајн. Безжични и мобилни технологии, Управување со софтверски проекти, Менаџмент во ИКТ, Семантички овозможени архитектури, Архитектура на компјутери. Ги држи последипломските предмети: Инженерство на барањата, Управување со софтверски проекти и Објектни архитектури за масивни системи. Подрачје на научно истражување му се: системи за електронско гласање, семантички овозможени архитектури, мобилните и сеприсутни апликации, е-бизнис и е-владини сервисии. Вкупно има објавено над рецензирани научни трудови во научни списанија и меѓународни научни конференции. Бил редовен колумнист со стручни статии во магазинот Лајф. Автор е на едно универзитетско учебно помагало. Учествувал во повеќе меѓународни истражувачки и образовни проекти за структурни реформи, како: UNDP Capacity building of the Voters List Unit, Technical Assistance for the Support to the Decentralization Process, SWEB Secure, interoperable, cross border m-services contributing towards a trustful European cooperation with the non-EU member Western Balkan countries, WE-GO Enhancing Western Balkan e-Government Expertise, Development and Implementation of a Resource Management Information System for the Albanian State Police, Workflow and Document Management Infrastructure towards Integrated University, Technical Assistance for Vocational Education Training, Technical Assistance to Institutional Building in Support of Employment Policyфаза 1 и 2, Management and Business Education in Computer Studies, Implementation of Modules and ECTS, Labor Market Analysis in the Border Region, Information and Communication Technologies for the Development of Education and the Construction of a Knowledge Society, Innovation of Computer Science Curriculum in Higher Education, Mobile and Wireless Security Protocols and Standards. Автор е на информацискиот систем на Државната изборна комисија на Македонија, Централната изборна комисија на Косово и Централната изборна комисија на Босна и Херцеговина. Автор е на предлог архитектурата на Управата за водење матични книги. Работи како ИКТ вештак. Претседател е на техничкиот комитет за ИКТ при Институтот за стандардизација на Република Македонија. Член е на следниве научни и стручни организации: IST-ACT, Mobile Consortium International, World Federation of Scientists, World Scientific and Engineering Academy and Society, Institute of Electrical and Electronics Engineering, Association ofComputer Machinery, Друштвото за електроника, телекоминукации, автоматика и информатика, Инженерската асоцијација на Македонија, IAESTE.\n.",
  "consultative_terms": "Редовни консултацииДен: петок10:00 - 11:00Училница: M5Ден: четврток18:45 - 19:45Училница: M5"
},
{
  "name": "д-р Дејан Ѓорѓевиќ",
  "description": "Роден е 1967 година во Скопје. Дипломирал, магистрирал и докторирал на Електротехничкиот факултет во Скопје во 1992, 1997 и 2004 година, соодветно. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје е вработен во 1992 година како помлад асистент. Во 2004 и 2009 година е избран во звањата доцент и вонреден професор, соодветно, а во 2014 во редовен професор. Одговорен е за 6 предмети на додипломски и четири предмети на магистерски студии. Автор е на преку\nобјавени на домашни и меѓународни конференции и списанија. Учествувал во десетина апликативно истражувачки мултилатерални и билатерални проекти со повеќе универзитети од Европската унија. Член е на IEEE од 1991 и на ACM од 1997 година. Полињата на неговиот научно-истражувачки интерес вклучуваат: препознавање на облици, софтверско инженерство, машинско учење и напредни веб технологии.\nПовеќе информации можете да најдете на следниов\n.\n.",
  "consultative_terms": "Редовни консултацииДен: петок10:00 - 12:00Училница: 219Ден: четврток16:00 - 18:00Училница: 219"
},
{
  "name": "д-р Андреа Кулаков",
  "description": "(Октомври 2011) Андреа Кулаков заврши гимназија во 1990, на возраст од 16 години, откако успеа на два пати да зема по две школски години во една (7 и 8 одд. и III и IV год. во средно). Потоа се запиша на Електротехнички факултет Скопје и во 1995 година дипломира со највисок просек 9,91 во својата генерација 1990-95. Во 1995 ги почна постдипломските студии по Когнитивни науки на Нов бугарски универзитет во Софија, Бугарија, во мала меѓународна група на студенти со настава на англиски јазик. Студиите ги заврши со одличен успех (5,71 од макс. 6,00). Во јули 1998 ја одбрани својата магистерска теза “Vygovorotsky – An Anticipative and Analogy-making Actor” со одличен успех (5,50), пред пет-члена меѓународна комисија (без менторот). Во 1999 магистерската диплома беше нострифицирана на Електротехнички факултет Скопје. Во текот на 9 месечниот воен рок во 1999 г. беше и демонстратор на Воената академија по предметот „Информатика“. Потоа шест месеци работеше во меѓународната софтверска компанија Мак-Систем, од кои месец и пол беше на обука во Париз, Франција. Од април 2000 г. до септември 2011 г., Андреа Кулаков беше вработен на Институтот за Компјутерска техника и информатика при Електротехнички факултет (подоцна Факултет за електротехника и информациски технологии) Скопје, прво како асистент, а од 2007 г. како доцент. Има предавано повеќе предмети од областите на Вештачка интелигенција, Роботика и Бази на податоци и во прв и во втор циклус на студии. Во јуни 2005 година ја освои наградата за истражувања кои водат до одбрана на докторска дисертација од најголемото друштво на електро инженери ИЕЕЕ, поточно од нивното Друштво за Компјутерска интелигенција (\nподолу, во делот за 2005). Во декември 2006 година ја одбрани својата докторска теза “Управување со податоци кај безжични сензорски мрежи” на Факултетот за електротехника и информациски технологии. Бил истражувач и главен истражувач на неколку домашни и меѓународни проекти, финансирани од МОН, од програмите ТЕМПУС и од Рамковната програма 6 на Европската Унија. Во 2008 го основа напредното технолошко Друштво за истражување и развој НИ ТЕКНА – Интелигентни технологии (\n), кое работи на развој на напредни решенија каде е неопходна примената на техниките од Вештачката интелигенција. Во март 2011 беше еден од основачите на Факултетот за информатички науки и компјутерско инженерство Скопје. Во Август 2011 беше избран за раководител на Институтот за интелигентни системи при Факултетот за информатички науки и компјутерско инженерство. Одговорен е за неколку предмети на додипломски и магистерски студии од областите вештачка интелигенција, анализа на податоци, роботика и безжични сензорски мрежи. Има објавено преку 60 научни труда на меѓународни конференции и во меѓународни списанија, како и поглавје во книга. Неговите истражувања се фокусирани на областите: роботика, деловна интелигенција, обработка на слика и звук и други подобласти на когнитивни науки и вештачка интелигенција. Покрај мајчиниот македонски, зборува течно и англиски, српски и бугарски, а се служи и со германски, француски, руски и словенечки јазик.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток15:00 - 17:00Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Ана Мадевска Богданова",
  "description": "Родена е 1967 година во Скопје. Основно и средно образование завршила во Скопје. Во 1991 година дипломирала на Институтот за информатика при ПМФ во Скопје како најдобар дипломиран студент во тековната академска година. На Институтот за информатика почнала и да работи како стручен соработник во 1992 година. Во 1996 година магистрирала на темата „Модификација на повеќеслојни невронски мрежи без повратни врски и нивно изучување“ (магистер по информатички науки), а во 2003-тата ја одбранила докторската дисертација под наслов “Препознавање облици со примена на машините со поддржувачки вектори и повеќеслојните невронски мрежи без повратни врски“ (доктор на информатички науки), на ИИ, ПМФ. Од пролетта 2004 работи како доцент на Институтот за информатика и држи настава по предметите: интелигентни системи, биоинформатика, основи на оперативните системи, основи на програмирање, објектно и визуелно програмирање, методика на информатичката настава, практикум, информациски технологии во образованието. Наставник е и на постдипломските студии по информатика и биологија. Главно подрачје на научен интерес на проф. Мадевска-Богданова е областа на вештачките интелигентни системи - препознавање облици, биоинформатика, податочно рударење, а работи и на формализираното претставување на знаење и на методиката на наставата по информатика. Објавила 40-тина трудови од областите на нејзиниот интерес во книги списанија со импакт фактор, меѓународни списанија и зборници на трудови од меѓународни и домашни конференции. Досега објавила неколку учебни помагала, како и материјали за сите курсеви кои ги одржувала. Била уредник во списанието Бит+, во издание на ИИ. Учествувала во вкупно 7 домашни и 8 меѓународни научноистражувачки проекти. Мадевска-Богданова престојувала на неколку странски универзитети. Ги следела Интернационалната летна школа за когнитивна наука во Софија и ERASMUS програмата за математички методи во технологијата во Антверпен, Белгија. Во рамките на TEMPUS проект имала 3-месечен престој во Лувен, Белгија. Во текот на последните 15 години неколку пати имала стручен престој на Католичкиот универзитет во Лувен, Белгија, и на Мастрихт -универзитетот, Холандија. Била поканет предавач на Универзитетот во Мејн, САД. Во 2003-2005 година била раководител на Компјутерскиот центар на ИИ, а од 2005-2009 година била раководител на Заводот за програмско инженерство и раководела со активностите за промоција на ИИ. Почнувајќи од 2009-та година, таа е Раководител на Институтот за информатика. Член е на Здружението на информатичарите на Македонија и во неколку наврати била претседател на комисии за натпревари. Член е на Европското здружение за невронски мрежи.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток14:30 - 16:30Училница: Online (Courses - Консултации)Ден: вторник12:00 - 14:00Училница: ТМФ 224Ден: вторник12:00 - 14:00Училница: ТМФ 224"
},
{
  "name": "д-р Димитар Трајанов",
  "description": "Professor Dimitar Trajanov, Ph.D. is a Head of the Department of Information systems and network technologies at the Faculty of Computer Science and Engineering - ss. Cyril and Methodius University –Skopje. From March 2011 until September 2015, he was the first Dean of the Faculty of Computer Science and Engineering, and in his tenure, the Faculty has become the largest technical Faculty in Macedonia. Dimitar Trajanov is the leader of the Regional Social Innovation Hub established in 2013 as a cooperation between UNDP and the Faculty of Computer Science and Engineering. From 2012 to 2015, he was a member of the National Committee for Innovation and Entrepreneurship where he worked on strategies and legislation to encourage innovation and entrepreneurship in the Republic of Macedonia through inspiring the use of technology for economic development.\nDimitar Trajanov is the author of more than 170 journal and conference papers and seven books. He has been involved in more than 70 research and industry projects, of which in more than 50 projects as a project leader. His research interests include Data Science, Machine Learning, NLP, FinTech, Semantic Web, Open Data, Sharing Economy, Social Innovation, e-commerce, Entrepreneurship, Technology for Development, Mobile Development, and Climate Change.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник14:20 - 16:00Училница: M9Ден: четврток19:00 - 21:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Слободан Калајџиски",
  "description": "Роден е 1976 година во Охрид. Дипломирал и магистрирал на Електротехничкиот факултет во Скопје во 2000 и 2004, соодветно. Докторирал на Факултетот за електротехника и информациски технологии во 2008 година. Првото работно искуство го имал во Неоком А.Д. во 2000 година, каде работел на позициите софтверски архитект, проект менаџер и програмер. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 2000 година како демонстратор. Звањата помлад асистент и асистент ги стекнал во 2003 и 2005 година, соодветно. Во 2008 година бил избран во звањето доцент. Како асистент бил вклучен во одржувањето настава по предмети од областа на програмски јазици, структури и бази на податоци, структурирано програмирање, објектно ориентирано програмирање, објектно ориентирани системи, бази на податоци, објектно ориентирана анализа и дизајн и информациони системи. Како доцент одржува настава по предмети од областа на објектно ориентирани системи, бази на податоци 2, објектно ориентирана анализа и дизајн и информациони системи. Координатор е на магистерските студиски програми Содржинско базирано пребарување и Интелигентни информациони системи, каде одржува настава на дел од предметите покриени со овие студиски програми. Автор е на триесетина научни трудови објавени на меѓународни и домашни конференции и списанија. Учествувал во 8 научно-истражувачки проекти. Полињата на научно-истражувачки интерес вклучуваат биоинформатика, системска биологија, откривање на знаење во податоци, податочно рударење, податочни складишта, бази на податоци, анализа и дизајн на информациони системи.\n.",
  "consultative_terms": "Редовни консултацииДен: понеделник16:00 - 18:00Училница: АНЕКС ФЕИТ"
},
{
  "name": "д-р Владимир Трајковиќ",
  "description": "Роден е 1971 година во Скопје. Дипломирал, магистрирал и докторирал на Електротехничкиот факултет во Скопје во 1994, 1997 и 2003 година, соодветно. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 1997 година како асистент. Во 2004, 2008 и 2013 година ги стекнал звањата доцент, вонреден професор и редовен професор. Моментално е одговорен за неколку предмети на додипломски студии и три предмети на магистерски студии. Исто така држи предавања на магистерски студии на Институтот за социолошки, политички и правни истражувања при универзитетот “Св. Кирил и Методиј“ во Скопје. Автор е на повеќе од 200 трудови публикувани во реномирани меѓународни научни списанија и зборници од конференции. Учесник е во повеќе од триесетина апликативно истражувачки мултилатерални и билатерални проекти со повеќе универзитети од Европската унија и САД во чии рамки остварил бројни студиски престои. Неговите истражувања се фокусирани на областите: дистрибуирани компјутерски системи, системи за поддршка на образованието на далечина, сервисно ориентирани архитектури, мобилни сервиси и поврзано здравство.\n.",
  "consultative_terms": "Редовни консултацииДен: вторник12:00 - 14:00Училница: ТМФ 10Ден: четврток14:00 - 16:00Училница: ТМФ 10"
},
{
  "name": "д-р Верица Бакева",
  "description": "Родена е 1969 година во Кавадарци, каде што завршила основно и средно образование со континуиран одличен успех. Во учебната 1988/89, се запишала на студиите по математика-информатика на ПМФ и ги завршила во 1992, стекнувајќи се со звањето дипломиран инженер по математика-информатика. Во 1993 година запишала постдипломски студии на ИИ при ПМФ. Во 1998 година ги завршила со одбрана на магистерскиот труд “Едноканални системи за масовно опслужување со квазигеометриски влезен поток и дискретно распределено време на опслужување” и се здобила со звањето магистер по математичко-информатички науки. Во 2003 година, со одбрана на докторската дисертација под наслов “Прилог кон примената на веројатносни модели во системите за масовно опслужување, криптографијата и кодирањето”, се стекнала со титулата доктор на информатички науки.\nВерица Бакева е примена за стручен соработник на ИИ при ПМФ во 1993, во 1996 била избрана за помлад асистент, во 1998 за асистент во Заводот за теориски основи на информатиката на ИИ, во 2003 година за доцент, а од 2008 е вонреден професор.\nКако асистент изведувала вежби од следниве предмети од областа на математиката и информатиката: Теорија на веројатноста, Математичка статистика, Теорија на информациите, Теорија и методи на линеарното програмирање, Аналитичка геометрија (на студиите по информатика), Векторски простори, Веројатност, Веројатност и статистика (на студиите по математика), Математички методи во хемијата (на студиите по хемија), како и Информатика на Земјоделскиот и на Филозофскиот факултет. Како наставник изведува/ла настава по предметите: Теорија на веројатност, Веројатност, Теорија на информации, Калкулус 1, Калкулус 2, Диференцијално сметање, Интегрално сметање, Математичка анализа, Операциони истражувања (на студиите по информатика), Случајни процеси (на студиите по математика), Информатика (на студиите по математика-физика, по биологија, биологија-хемија и по историја и социологија на Филозофскиот факултет). На постдипломските студии била задолжена за предметите Теорија на информации, Случајни процеси и Теорија на кодирање, а изведувала вежби по Теорија на веројатноста и математичка статистика со примена во градежната техника за постдипломците од Градежниот факултет.\nНаучна област на нејзин интерес се веројатносните модели и нивните примени, пред се, во теорија на кодирање и криптографија. Има објавено триесетина научни труда. Учествувала на повеќе конференции во земјата и странство со презентирање на свои трудови. Како помлад истражувач, учествувала во два, а како истражувач во пет проекти финансирани од Министерството за наука на Р.Македонија и во три меѓународни проекти. Автор е на пет учебници и на една збирка задачи за гимназиско и средно-стручно образование. Во периодот 1995-97 била секретар на Советот на Математичко-информатичката школа за талентирани ученици, а во 1997 и нејзин предавач. Член е на Здружението на информатичарите на Македонија.",
  "consultative_terms": "Редовни консултацииДен: среда11:00 - 13:00Училница: M12Ден: четврток11:00 - 13:00Училница: Online (Courses - Консултации), Online"
},
{
  "name": "д-р Сузана Лошковска",
  "description": "Родена е 1966 година во Скопје. Дипломирала и магистрирала на Електротехничкиот факултет во Скопје во 1988 и 1992 година, соодветно. Докторските студии ги завршила на Техничкиот универзитет во Виена, Австрија, во 1995 година. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од февруари 1992 година, како помлад асистент, а во 1995 година e избрана за асистент. Во својата професионална кариера напредувала во звањата доцент, вонреден професор и редовен професор во 1997, 2002 и 2007 година, соодветно. Во периoдот 2004-2008 година ја извршувала функцијата продекан за настава на Факултетот за електротехника и информациски технологии. Автор е на стотина научни трудови од областа на компјутерската техника и информатика, девет трудови поврзани со имплементацијата на Европскиот кредит трансфер систем и два учебника за учениците од средното образование. Учествувала во и раководела со повеќе домашни и меѓународни научни проекти. Член е на меѓународните здруженија IEEE, ACM и IASTED. Од 2006 година ја извршува функцијата потпретседател на IEEE секцијата на Р Македонија. Член е на бордот на едитори на списанието INFORMATICA, интернационално списание за компјутери и информатика од Р. Словенија. Нејзините истражувања се фокусирани на областите: визуелизација на податоци, кориснички интерфејси, виртуелна реалност, медицинска информатика.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток10:00 - 12:00Училница: 219Дополнителни консултации Датум: 20-05-202510:00 - 11:30Училница: 219"
},
{
  "name": "д-р Катерина Здравкова",
  "description": "Родена е 1960 година во Скопје, каде што оформила основно и средно образование. На Математичкиот факултет се запишала во академската 1978/79 година Насоката математика и информатика ја завршила во 1983 година. Магистрирала на Електротехничкиот факултет во Скопје, на насоката за компјутерска техника и информатика (КТИ) под менторство на проф. д-р Драган Михајлов, во 1988 година, со одбрана на трудот “Алгоритми за генетски истражувања”. Докторирала на ПМФ во 1993 година, со одбрана на дисертацијата “Систем за машинско преведување, реализиран со помош на невронски мрежи”, под менторство на проф. д-р Душан Сурла од Уиверзитетот во Нови Сад. Во 1989 година била избрана за асистент, во 1994 за доцент, во јуни 1999 година за вонреден професор, а од 2004 година е редовен професор на ИИ при ПМФ. Во академската 1988/89, како стипендист на British Council, имала студиски престој на Cranfield Institute of Technology во Англија, летото 1990 година престојувала на Universite Stendhal и на Institute GETA во Гренобл, Франција. Во 1992 година ја посетувала школата Contemporary Topics in Computational Linguistics во Цигов Чарк, Бугарија. Во 2000, со Tempus IMG стипедија, кратко престојувала на University of Wolverhampton, School of Computing and Information Technology, Centre of Learning and Teaching и Delta Institute. Во рамките на Tempus JEP 13577/98, во 2000 година престојувала на University of Loughborough и University of Liecester, а во рамките на Phare во Центарот за отворено и далечинско учење на Open University во Лондон и во Milton Keynes. Во рамките на Tempus JEP 14440/99, во 2000 и 2001 година имала кратки престои на Aristotle University во Солун, а во 2003, со Tempus IMG03-FYR1007 престојувала во Љубљана, Словенија, на семинарот REGOC, во огранизација на IEEE. Последниве 5 години изведува/ла настава по 15 предмети на додипломските студии - по информатика: компјутерски апликации, програмски системи, учење со компјутер и примени, основи на вештачката интелигенција, филозофија на информатиката, учење со компјутер, дизајнирање на образовен софтвер, компјутерски системи во наставата; по хемија: вовед во информатиката и примена на компјутерите; по физика: информатика; по биологија: информатика за биолози; по биологија-хемија: математика со информатика; на Стоматолошкиот факултет: примена на компјутерите во стоматологијата и информатика. На постдипломските студии по информатика е задолжена за предметите: невронски мрежи, обработка на природните јазици, логичко програмирање, интерактивни мултимедиски системи за учење и софтверско инженерство. Од академската 2000/01 до 2004/05 година на постдипломските студии на Институтот за билогија ја изведувала наставата по примена на компјутерските пакети во биологијата. Од академската 2003/04 до 2005/06 година изведувала настава по информатика на постдипломските студии на Стоматолошкиот факултет. Здравкова била или е ментор на 3 докторски дисертации и на 1 магистерски труд. Објавила: 4 трудови во меѓународни списанија, 2 научни труда во домашно списание, 34 трудови во зборници од меѓународни научни собири и имала повеќе од 50 стручни презентации на меѓународни собири. Коавтор е на два средношколски учебника. Одржала 8 поканети предавања на меѓународни семинари и конференции. Д-р Здравкова е претставник на UNESCO Institute of Information Technology of Education (IITE) за Македонија и регионален координатор за Јужна Европа. Во рамките на UNESCO IITE, била национален координатор на два проекта. Исто така, таа е координатор на еден билатерален проект на МОН на Македонија, на два проекта на Deutsche Akademische Austausch Dienst (DAAD), на еден Темпус-проект и на еден NATO проект. Од 1999 година членува во Institute ofElectrical and Electronics Engineers (IEEE). Здравкова е член во програмските комитети на 4 меѓународни конференции. Таа е рецензент на Министерството за образование и наука на Македонија, на Министерството за наука на Хрватска, на две меѓународни списанија и на голем број конференции. Одликувана е со специјалното одликување на IEEE за исклучителен придонес.\n.",
  "consultative_terms": "Редовни консултацииДен: среда10:00 - 11:00Училница: M13, Online"
},
{
  "name": "д-р Марјан Гушев",
  "description": "Марјан Гушев, д-р на науки, работи како професор на Универзитетот Св. Кирил и Методиј (УКИМ), при факултетот за Информатички науки и компјутерско инженерство (Финки).\nТој е искусен научник, професор и иноватор, менаџер и експерт, со големо знаење и длабоко разбирање на научните концепти од компјутерските науки и нивната примена во голем дел од проекти, вклучувајќи био-инженеринг на медицински сигнали, теле-медицина, решенија од ерата на пресметување на работ, пресметување во облак и роса, паралелно процесирање, имплементација на електронски сервиси, менаџмент на Универзитет, развој на ИТ стратегија и управување итн.\nИма објавено 875 научни и стручни трудови, од кои 194 со фактор на влијание според извештајот на Web of Science JCR 2020, со 572 цитати и постигнат H-индекс од 10, (според Scopus има индексирано 238 статии, 1120 цитати и H-индекс 14, а според Scholar Google 506 статии, 2800 цитати и H-индекс 24). Два од неговите трудови од 2018 и 2017 достигаат висока цитираност од 50 и 37 цитати соодветно, според Web of Science и се наоѓаат во 98-миот персентил од сите можни статии. Според анализата на УКИМ, тој е автор со најмногу објавени статии од професори на УКИМ индексирани според Web of Science, со просечно една статија месечно за последните десет години (просекот на професори од УКИМ изнесува 0.16 годишно). Има објавено 3 патенти кај светската организација за интелектуална сопственост.\nНеговото огромно искуство во работата вклучува крос-функционални меѓународни од голем број на дивергентни области, потврдено како проектен раководител на 18 и учесник на други 18 проекти од Европската Комисија, како што е H2020, FP7, FP6, COIN, и TEMPUS со тотален буџет повеќе од 7 милиони евра, а воедно е раководител на 11  национални проекти, од кои два од Фондот за иновации и технолошки развој, како и и учесник на други 3 национални проекти. Реализирал повеќе проекти од областа на Е-Влада, Е-Бизнис, што вклучуваат развој на национална стратегија и акциски план, односно реализација на триаголна платформа универзитет (знаење) - влада (управување) - индустрија (примена).\nВо својата 30-годишна наставна активност, одржува настава по 235 курсеви на додипломски, после-дипломски и докторски студии, публикувал 23 книги, и 30 учебни помагала, а воедно бил ментор на 11 докторанди и 14 магистранти, од кои 12 се денеска актуелни универзитетски професори во земјава и светот.\nОрганизирал 8 меѓународни конференции и 30 работилници, иницирал и раководи со повеќе лаборатории и специјализирани академии, член е на повеќе меѓународни здруженија од областа на информатика, вклучувајќи и основање на IEEE Dew Computing Special Technical Society. Добитник е на многу награди и признанија, како што се повеќе награди најдобра статија на меѓународни конференции, печат на одличност од Европската комисија за H2020, награда за најдобар научник на УКИМ во 2012, како и наградата „Св. Кирил и Методиј“ во знак на признание за достигнувањата во наставно-образовната дејност, како и за неговите заслуги во развојот и унапредувањето на високото образование и афирмација на Универзитетот во државата и пошироко во 2016.\nВо 2020-та е избран за дописен член на Словенечката Академија за инженери.\n.",
  "consultative_terms": "Редовни консултацииДен: четврток11:30 - 12:00Училница: M4Ден: вторник17:00 - 18:00Училница: M4, Online"
}
]